/*
 * Authors: JavaRush's team, CodeGym's team, Altavista360
 * Version: 1.0.0
 */

/*
 * // JavaRush
 * Задача: Регистрация нового игрока 🎮
 * Ссылка: https://javarush.com/tasks/ru.javarush.java.core.level02.task18
 */

/*
 * // CodeGym
 * Task: New Player Registration 🎮
 * Link: https://codegym.cc/tasks/en.codegym.java.core.level02.task18
 */

/*
 * // JavaRush
 * Условие:
 * Представьте, что вы создаете форму для регистрации нового игрока.
 * Напишите программу, которая сначала запрашивает имя игрока (строку), а затем его возраст (целое число).
 * После этого программа должна вывести на экран возраст и имя игрока, каждое с новой строки.
 */

/*
 * // JavaRush
 * Требования:
 * • В программе должен использоваться класс Scanner для чтения данных с клавиатуры.
 * • Программа должна запросить и считать имя игрока как строку с использованием Scanner.
 * • Программа должна запросить и считать возраст игрока как целое число с использованием Scanner.
 * • Сначала на отдельной строке должно быть выведено считанное целое число (возраст игрока).
 * • На следующей строке должно быть выведено считанное имя игрока.
 */

/*
 * // JavaRush
 * Черновик:
 * package ru.javarush.java.core.level02.task18;
 *
 * import java.util.Scanner;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Создаем объект Scanner для чтения данных с клавиатуры
 *
 *
 *         // Запрашиваем и считываем имя игрока
 *
 *
 *         // Запрашиваем и считываем возраст игрока
 *
 *
 *         // Сначала выводим возраст, затем имя, каждый с новой строки
 *
 *
 *     }
 * }
 */

// JavaRush
package ru.javarush.java.core.level02.task18;

import java.util.Scanner;

public class Solution {
    public static void main(String[] args) {
        // Создаем объект Scanner для чтения данных с клавиатуры
        Scanner keyboard = new Scanner(System.in);

        // Запрашиваем и считываем имя игрока
        String name = keyboard.nextLine();

        // Запрашиваем и считываем возраст игрока
        int age = keyboard.nextInt();

        // Сначала выводим возраст, затем имя, каждый с новой строки
        System.out.println(age);
        System.out.println(name);
    }
}

/*
 * // JavaRush
 * Правильное решение:
 * // Author: JavaRush's team
 * package ru.javarush.java.core.level02.task18;
 *
 * import java.util.Scanner;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Создаем объект Scanner для чтения данных с клавиатуры
 *         Scanner console = new Scanner(System.in);
 *
 *         // Запрашиваем и считываем имя игрока
 *         System.out.println("Введите имя игрока:");
 *         String playerName = console.nextLine();
 *
 *         // Запрашиваем и считываем возраст игрока
 *         System.out.println("Введите возраст игрока:");
 *         int playerAge = console.nextInt();
 *
 *         // Сначала выводим возраст, затем имя, каждый с новой строки
 *         System.out.println(playerAge);
 *         System.out.println(playerName);
 *     }
 * }
 */