/*
 * Authors: JavaRush's team, CodeGym's team, Altavista360
 * Version: 1.0.0
 */

/*
 * // JavaRush
 * Задача: Первая загрузка игры 🎮
 * Ссылка: https://javarush.com/tasks/ru.javarush.java.core.level04.task09
 */

/*
 * // CodeGym
 * Task: First game launch 🎮
 * Link: https://codegym.cc/tasks/en.codegym.java.core.level04.task09
 */

/*
 * // JavaRush
 * Условие:
 * Представьте, что ваша игра должна выполнить действие хотя бы один раз при первом запуске, независимо от условий.
 * Создайте переменную int gameVersion и присвойте ей значение 10.
 * Используйте цикл do-while, чтобы вывести на экран "Загрузка данных...", а затем значение gameVersion один раз, даже если условие выхода из цикла сразу ложно.
 */

/*
 * // JavaRush
 * Требования:
 * • В программе должна быть объявлена переменная int с именем gameVersion.
 * • Переменной gameVersion должно быть присвоено значение 10.
 * • Для выполнения действий должен использоваться цикл do-while.
 * • В теле цикла do-while должно быть выведено сообщение "Загрузка данных...".
 * • В теле цикла do-while должно быть выведено значение переменной gameVersion.
 * • Тело цикла do-while должно выполниться хотя бы один раз, даже если условие выхода из цикла ложно.
 */

/*
 * // JavaRush
 * Черновик:
 * package ru.javarush.java.core.level04.task09;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Объявляем переменную gameVersion и присваиваем ей значение 10
 *
 *
 *         // Используем цикл do-while для выполнения действий хотя бы один раз
 *         do {
 *             // Выводим сообщение "Загрузка данных..."
 *
 *             // Выводим значение переменной gameVersion
 *
 *         } while (/* условие */); // Условие выхода из цикла сразу ложно
 *     }
 * }
 */

// JavaRush
package ru.javarush.java.core.level04.task09;

public class Solution {
    public static void main(String[] args) {
        // Объявляем переменную gameVersion и присваиваем ей значение 10
        int gameVersion = 10;

        // Используем цикл do-while для выполнения действий хотя бы один раз
        do {
            // Выводим сообщение "Загрузка данных..."
            System.out.println("Загрузка данных...");
            // Выводим значение переменной gameVersion
            System.out.println(gameVersion);
        } while (false/* условие */); // Условие выхода из цикла сразу ложно
    }
}

/*
 * // JavaRush
 * Правильное решение:
 * // Author: JavaRush's team
package ru.javarush.java.core.level04.task09;

public class Solution {
    public static void main(String[] args) {
        // Объявляем переменную gameVersion и присваиваем ей значение 10
        int gameVersion = 10;

        // Используем цикл do-while для выполнения действий хотя бы один раз
        do {
            // Выводим сообщение "Загрузка данных..."
            System.out.println("Загрузка данных...");
            // Выводим значение переменной gameVersion
            System.out.println(gameVersion);
        } while (false); // Условие выхода из цикла сразу ложно
    }
}
 */