/*
 * Authors: JavaRush's team, CodeGym's team, Altavista360
 * Version: 1.0.0
 */

/*
 * // JavaRush
 * Задача: Пригласительные на конференцию 🎤
 * Ссылка: https://javarush.com/tasks/ru.javarush.java.core.level03.task07
 */

/*
 * // CodeGym
 * Task: Conference Invitations 🎤
 * Link: https://codegym.cc/tasks/en.codegym.java.core.level03.task07
 */

/*
 * // JavaRush
 * Условие:
 * Вы — организатор конференции и проверяете тип приглашения. Попросите пользователя ввести его возраст и код приглашения.
 * Если возраст больше или равен 21:
 * • Если код — "VIP", выведите "Доступ к VIP-залу разрешен.".
 * • Если код — "GUEST", выведите "Гостевой доступ разрешен.".
 * • Иначе выведите "Неверный код приглашения.".
 * Если возраст меньше 21, выведите "К сожалению, только с 21 года.".
 */

/*
 * // JavaRush
 * Требования:
 * • Программа должна запросить и считать возраст пользователя с клавиатуры.
 * • Программа должна запросить и считать код приглашения с клавиатуры.
 * • Если введённый возраст меньше 21, программа должна вывести "К сожалению, только с 21 года." и завершить выполнение.
 * • Если возраст пользователя 21 или больше, программа должна проверить код приглашения: - Если код равен "VIP", вывести "Доступ к VIP-залу разрешен.". - Если код равен "GUEST", вывести "Гостевой доступ разрешен.". - В любом другом случае вывести "Неверный код приглашения.".
 */

/*
 * // JavaRush
 * Черновик:
 * package ru.javarush.java.core.level03.task07;
 *
 * import java.util.Scanner;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         Scanner console = new Scanner(System.in);
 *
 *         // Запрашиваем и считываем возраст пользователя
 *         System.out.println("Введите ваш возраст:");
 *         int age = Integer.parseInt(console.nextLine());
 *
 *         // Запрашиваем и считываем код приглашения
 *         System.out.println("Введите код приглашения:");
 *         String code = console.nextLine().trim();
 *
 *         // Вложенная логика: сначала проверяем возраст, затем код
 *         if (/* условие */) {
 *             // Возраст подходит — проверяем тип приглашения
 *             if (/* условие */) {
 *
 *             } else if (/* условие */) {
 *
 *             } else {
 *
 *             }
 *         } else {
 *             // Возраст меньше 21 — доступ запрещен
 *
 *         }
 *     }
 * }
 */

// JavaRush
package ru.javarush.java.core.level03.task07;

import java.util.Scanner;

public class Solution {
    public static void main(String[] args) {
        Scanner console = new Scanner(System.in);

        // Запрашиваем и считываем возраст пользователя
        System.out.println("Введите ваш возраст:");
        int age = Integer.parseInt(console.nextLine());

        // Запрашиваем и считываем код приглашения
        System.out.println("Введите код приглашения:");
        String code = console.nextLine().trim();

        // Вложенная логика: сначала проверяем возраст, затем код
        if (age >= 21) {
            // Возраст подходит — проверяем тип приглашения
            if (code.equals("VIP")) {
            System.out.println("Доступ к VIP-залу разрешен.");
            } else if (code.equals("GUEST")) {
            System.out.println("Гостевой доступ разрешен.");
            } else {
            System.out.println("Неверный код приглашения.");
            }
        } else {
            // Возраст меньше 21 — доступ запрещен
            System.out.println("К сожалению, только с 21 года.");
        }
    }
}

/*
 * // JavaRush
 * Правильное решение:
 * // Author: JavaRush's team
 * package ru.javarush.java.core.level03.task07;
 *
 * import java.util.Scanner;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         Scanner console = new Scanner(System.in);
 *
 *         // Запрашиваем и считываем возраст пользователя
 *         System.out.println("Введите ваш возраст:");
 *         int age = Integer.parseInt(console.nextLine());
 *
 *         // Запрашиваем и считываем код приглашения
 *         System.out.println("Введите код приглашения:");
 *         String code = console.nextLine().trim();
 *
 *         // Вложенная логика: сначала проверяем возраст, затем код
 *         if (age >= 21) {
 *             // Возраст подходит — проверяем тип приглашения
 *             if ("VIP".equals(code)) {
 *                 System.out.println("Доступ к VIP-залу разрешен.");
 *             } else if ("GUEST".equals(code)) {
 *                 System.out.println("Гостевой доступ разрешен.");
 *             } else {
 *                 System.out.println("Неверный код приглашения.");
 *             }
 *         } else {
 *             // Возраст меньше 21 — доступ запрещен
 *             System.out.println("К сожалению, только с 21 года.");
 *         }
 *     }
 * }
 */