/*
 * Authors: JavaRush's team, CodeGym's team, Altavista360
 * Version: 1.0.0
 */

/*
 * // JavaRush
 * Задача: Обратный отсчёт до Нового года 🎉
 * Ссылка: https://javarush.com/tasks/ru.javarush.java.core.level04.task05
 */

/*
 * // CodeGym
 * Task: Countdown to the New Year 🎉
 * Link: https://codegym.cc/tasks/en.codegym.java.core.level04.task05
 */

/*
 * // JavaRush
 * Условие:
 * Вы пишете программу для праздничного обратного отсчёта. Создайте цикл for, который выводит числа от 5 до 1 в обратном порядке (каждое число — на новой строке), а после завершения цикла выводит строку "С Новым годом!".
 */

/*
 * // JavaRush
 * Требования:
 * • В программе должен быть использован цикл for для организации обратного отсчёта.
 * • Цикл for должен выводить числа от 5 до 1 включительно в обратном порядке.
 * • Каждое число должно выводиться на новой строке.
 * • После завершения цикла на экран должна быть выведена строка "С Новым годом!".
 */

/*
 * // JavaRush
 * Черновик:
 * package ru.javarush.java.core.level04.task05;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Цикл for для обратного отсчёта от 5 до 1
 *         for (/* инициализация */; /* условие */; /* изменение */) {
 *             // Вывод текущего числа на новой строке
 *
 *         }
 *         // Вывод поздравления после завершения цикла
 *
 *     }
 * }
 */

// JavaRush
package ru.javarush.java.core.level04.task05;

public class Solution {
    public static void main(String[] args) {
        // Цикл for для обратного отсчёта от 5 до 1
        for (int currentCount = 5 /* инициализация */; currentCount >= 1 /* условие */; currentCount -= 1 /* изменение */) {
            // Вывод текущего числа на новой строке
        System.out.println(currentCount);
        }
        // Вывод поздравления после завершения цикла
        System.out.println("С Новым годом!");
    }
}

/*
 * // JavaRush
 * Правильное решение:
 * // Author: JavaRush's team
 * package ru.javarush.java.core.level04.task05;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Цикл for для обратного отсчёта от 5 до 1
 *         for (int i = 5; i >= 1; i--) {
 *             System.out.println(i); // Вывод текущего числа на новой строке
 *         }
 *         // Вывод поздравления после завершения цикла
 *         System.out.println("С Новым годом!");
 *     }
 * }
 */