## Authors: JavaRush's team, CodeGym's team, Altavista360
## Version: 1.0.0

### JavaRush
## Задача: Использование nonlocal переменной
## Ссылка: https://javarush.com/tasks/ru.javarush.python.core.level04.task20

### CodeGym
## Task: Using a nonlocal variable
## Link: https://codegym.cc/tasks/en.codegym.python.core.level04.task20

### JavaRush
## Условие:
# Напишите программу, в которой есть вложенная функция. Внешняя функция outer_function() должна объявлять переменную x и присваивать ей значение 10. Внутренняя функция inner_function() должна увеличивать значение переменной x на 5, используя оператор nonlocal. Затем вызовите внутреннюю функцию и выведите значение переменной x во внешней функции.

### JavaRush
## Требования:
# • Программа должна объявлять переменную x и присваивать ей значение 10 во внешней функции outer_function().
# • Внутренняя функция inner_function() должна использовать оператор nonlocal для доступа к переменной x, объявленной во внешней функции.
# • Внутренняя функция inner_function() должна увеличивать значение переменной x на 5.
# • Внешняя функция outer_function() должна вызвать внутреннюю функцию inner_function().
# • Внешняя функция outer_function() должна выводить значение переменной x после вызова внутренней функции.

### JavaRush
## Черновик:
# # Использование nonlocal переменной
#
# # Напишите программу, в которой есть вложенная функция.
# # Внешняя функция outer_function() должна объявлять переменную x и присваивать ей значение 10.
# # Внутренняя функция inner_function() должна увеличивать значение переменной x на 5, используя оператор nonlocal.
# # Затем вызовите внутреннюю функцию и выведите значение переменной x во внешней функции.
#
# # Напишите тут ваш код

### JavaRush
# Использование nonlocal переменной

# Напишите программу, в которой есть вложенная функция.
# Внешняя функция outer_function() должна объявлять переменную x и присваивать ей значение 10.
# Внутренняя функция inner_function() должна увеличивать значение переменной x на 5, используя оператор nonlocal.
# Затем вызовите внутреннюю функцию и выведите значение переменной x во внешней функции.

# Напишите тут ваш код

def outer_function():
    x = 10

    def inner_function():
        nonlocal x
        x += 5

    inner_function()
    print(x)

outer_function()

### JavaRush
## Правильное решение:
## Author: JavaRush's team
# def outer_function():
#     x = 10
#
#     def inner_function():
#         nonlocal x
#         x += 5
#
#     inner_function()
#     print(x)
#
# outer_function()