/*
 * Authors: JavaRush's team, CodeGym's team, Altavista360
 * Version: 1.0.0
 */

/*
 * // JavaRush
 * Задача: Разделение призов между командами 🎁
 * Ссылка: https://javarush.com/tasks/ru.javarush.java.core.level02.task03
 */

/*
 * // CodeGym
 * Task: Distributing prizes among teams 🎁
 * Link: https://codegym.cc/tasks/en.codegym.java.core.level02.task03
 */

/*
 * // JavaRush
 * Условие:
 * У вас есть 15 призов, которые нужно поделить между 4 командами. Создайте две переменные типа int: prizes со значением 15 и teams со значением 4.
 * Вычислите и выведите на экран, сколько целых призов получит каждая команда. На новой строке выведите, сколько призов останется после раздачи.
 */

/*
 * // JavaRush
 * Требования:
 * • В программе должны быть объявлены две переменные типа int: prizes со значением 15 и teams со значением 4.
 * • Программа должна вычислять, сколько целых призов получит каждая команда, используя целочисленное деление.
 * • Программа должна вычислять, сколько призов останется после раздачи, используя оператор остатка от деления (%).
 * • Программа должна вывести на экран сначала количество призов, полученных каждой командой (целое число), затем на новой строке вывести остаток призов.
 */

/*
 * // JavaRush
 * Черновик:
 * package ru.javarush.java.core.level02.task03;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Объявляем общее количество призов и число команд
 *
 *
 *         // Вычисляем, сколько целых призов получит каждая команда (целочисленное деление)
 *
 *
 *         // Вычисляем, сколько призов останется после раздачи (оператор %)
 *
 *
 *         // Выводим количество призов на команду
 *
 *         // Выводим остаток призов
 *
 *     }
 * }
 */

// JavaRush
package ru.javarush.java.core.level02.task03;

public class Solution {
    public static void main(String[] args) {
        // Объявляем общее количество призов и число команд
        int prizes = 15, teams = 4;

        // Вычисляем, сколько целых призов получит каждая команда (целочисленное деление)
        int foo = prizes / teams;

        // Вычисляем, сколько призов останется после раздачи (оператор %)
        int bar = prizes % teams;

        // Выводим количество призов на команду
        System.out.println (foo);

        // Выводим остаток призов
        System.out.println (bar);
    }
}

/*
 * // JavaRush
 * Правильное решение:
 * // Author: JavaRush's team
 * package ru.javarush.java.core.level02.task03;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Объявляем общее количество призов и число команд
 *         int prizes = 15;
 *         int teams = 4;
 *
 *         // Вычисляем, сколько целых призов получит каждая команда (целочисленное деление)
 *         int prizesPerTeam = prizes / teams;
 *
 *         // Вычисляем, сколько призов останется после раздачи (оператор %)
 *         int remainder = prizes % teams;
 *
 *         // Выводим количество призов на команду
 *         System.out.println(prizesPerTeam);
 *         // Выводим остаток призов
 *         System.out.println(remainder);
 *     }
 * }
 */