## Authors: JavaRush's team, CodeGym's team, Altavista360
## Version: 1.0.0

### JavaRush
## Задача: Имя сестра, имя.
## Ссылка: https://javarush.com/tasks/ru.javarush.python.core.level03.task05

### CodeGym
## Task: Sister's name, name.
## Link: https://codegym.cc/tasks/en.codegym.python.core.level03.task05

### JavaRush
## Условие:
# Напишите программу, которая запрашивает у пользователя его имя и выводит приветственное сообщение. Пример: Введите ваше имя: Анна Привет, Анна!

### JavaRush
## Требования:
# • Программа должна включать переменную, которой присваивается строковое значение, содержащее имя пользователя.
# • Программа должна выводить сообщение, запрашивающее у пользователя ввести его имя.
# • Программа должна считывать введенное пользователем имя.
# • Программа должна выводить приветственное сообщение, включающее имя, введенное пользователем.

### JavaRush
## Черновик:
# # Имя сестра, имя.
# 
# # Напишите программу, которая запрашивает у пользователя его имя и выводит приветственное сообщение.
# # Пример:
# # Введите ваше имя: Анна
# # Привет, Анна!
# 
# # Напишите тут ваш код

### JavaRush
# Имя сестра, имя.

# Напишите программу, которая запрашивает у пользователя его имя и выводит приветственное сообщение.
# Пример:
# Введите ваше имя: Анна
# Привет, Анна!

# Напишите тут ваш код

input_name = input("Your name: ")
print("Hi,", input_name, "!")

### JavaRush
## Правильное решение:
## Author: JavaRush's team
# name = input("Введите ваше имя: ")
# print("Привет,", name)