## Authors: JavaRush's team, CodeGym's team, Altavista360
## Version: 1.0.0

### JavaRush
## Задача: Тест на логику
## Ссылка: https://javarush.com/tasks/ru.javarush.python.core.level03.task02

### CodeGym
## Task: Logic Test
## Link: https://codegym.cc/tasks/en.codegym.python.core.level03.task02

### JavaRush
## Условие:
# Кто-то случайно перепутал значения переменных. Присвой им правильные значения так, чтобы они совпадали по смыслу с именами. age = "London" city = "Jack" name = 18

### JavaRush
## Требования:
# • Программа должна включать переменную age, которой присваивается числовое значение, указывающее возраст (например, 18).
# • Программа должна включать переменную city, которой присваивается строковое значение, содержащее название города (например, "London").
# • Программа должна включать переменную name, которой присваивается строковое значение, содержащее имя (например, "Jack").

### JavaRush
## Черновик:
# # Тест на логику
# 
# # Кто-то случайно перепутал значения переменных.
# # Присвой им правильные значения так, чтобы они совпадали по смыслу с именами.
# 
# age = "London"
# city = "Jack"
# name = 18

### JavaRush
# Тест на логику

# Кто-то случайно перепутал значения переменных.
# Присвой им правильные значения так, чтобы они совпадали по смыслу с именами.

age = 18
city = "London"
name = "Jack"

### JavaRush
## Правильное решение:
## Author: JavaRush's team
# age = 18
# city = "London"
# name = "Jack"