/*
 * Authors: JavaRush's team, CodeGym's team, Altavista360
 * Version: 1.0.0
 */

/*
 * // JavaRush
 * Задача: Разблокировка смартфона 📱
 * Ссылка: https://javarush.com/tasks/ru.javarush.java.core.level04.task02
 */

/*
 * // CodeGym
 * Task: Unlocking the smartphone 📱
 * Link: https://codegym.cc/tasks/en.codegym.java.core.level04.task02
 */

/*
 * // JavaRush
 * Условие:
 * Вы пишете программу для разблокировки смартфона. Пользователь должен ввести правильный пароль.
 * Запрашивайте у пользователя ввод пароля, пока он не введет слово "java". Как только пароль введен верно, выведите на экран "Смартфон разблокирован!".
 */

/*
 * // JavaRush
 * Требования:
 * • Программа должна использовать цикл while для повторного запроса пароля у пользователя.
 * • На каждой итерации цикла программа должна запрашивать у пользователя ввод пароля с клавиатуры.
 * • Введённое пользователем значение должно сравниваться со строкой "java".
 * • Цикл должен завершиться только тогда, когда пользователь введёт "java".
 * • После выхода из цикла программа должна вывести на экран сообщение "Смартфон разблокирован!".
 */

/*
 * // JavaRush
 * Черновик:
 * package ru.javarush.java.core.level04.task02;
 *
 * import java.util.Scanner;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         Scanner console = new Scanner(System.in);
 *
 *         String input = ""; // будем хранить введённый пользователем текст
 *
 *         // Запрашиваем пароль, пока пользователь не введёт точное слово "java"
 *         while (/* условие */) {
 *
 *         }
 *
 *         // Сообщение после успешного ввода
 *
 *     }
 * }
 */

// JavaRush
package ru.javarush.java.core.level04.task02;

import java.util.Scanner;

public class Solution {
    public static void main(String[] args) {
        Scanner console = new Scanner(System.in);

        String input = ""; // будем хранить введённый пользователем текст

        // Запрашиваем пароль, пока пользователь не введёт точное слово "java"
        while (!input.equals("java")) {
            System.out.println("Введите пароль:");
            input = console.nextLine();
        }

        // Сообщение после успешного ввода
        System.out.println("Смартфон разблокирован!");
    }
}

/*
 * // JavaRush
 * Правильное решение:
 * // Author: JavaRush's team
 * package ru.javarush.java.core.level04.task02;
 *
 * import java.util.Scanner;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         Scanner console = new Scanner(System.in);
 *
 *         String input = ""; // будем хранить введённый пользователем текст
 *
 *         // Запрашиваем пароль, пока пользователь не введёт точное слово "java"
 *         while (!"java".equals(input)) {
 *             System.out.println("Введите пароль:");
 *             input = console.nextLine();
 *         }
 *
 *         // Сообщение после успешного ввода
 *         System.out.println("Смартфон разблокирован!");
 *     }
 * }
 */