## Authors: JavaRush's team, CodeGym's team, Altavista360
## Version: 1.0.0

### JavaRush
## Задача: Шахматная задача
## Ссылка: https://javarush.com/tasks/ru.javarush.python.core.level03.task04

### CodeGym
## Task: Chess Problem
## Link: https://codegym.cc/tasks/en.codegym.python.core.level03.task04

### JavaRush
## Условие:
# За создание шахмат индийский ученый получил немного зерна. На первую клетку положили одно зернышко, на вторую - два, на третью - 4, и т.д. В итоге Раджа должен был выплатить 2^64-1 зерен. Выведи это число на экран.

### JavaRush
## Требования:
# • Программа должна включать переменную или выражение, которое будет хранить значение 2^64-1.
# • Программа должна осуществить вычисление выражения 2^64-1 для получения итогового числа зерен.
# • Программа должна вывести на экран итоговое число зерен, равное 2^64-1.

### JavaRush
## Черновик:
# # Шахматная задача
# 
# # За создание шахмат индийский ученый получил немного зерна.
# # На первую клетку положили одно зернышко, на вторую - два, на третью - 4, и т.д.
# # В итоге Раджа должен был выплатить 2^64-1 зерен.
# # Выведи это число на экран.
# 
# # Напишите тут ваш код

### JavaRush
# Шахматная задача

# За создание шахмат индийский ученый получил немного зерна.
# На первую клетку положили одно зернышко, на вторую - два, на третью - 4, и т.д.
# В итоге Раджа должен был выплатить 2^64-1 зерен.
# Выведи это число на экран.

# Напишите тут ваш код

foobar = 2**64 - 1
print(foobar)

### JavaRush
## Правильное решение:
## Author: JavaRush's team
# total_grains = 2**64 - 1
# print(total_grains)