/*
 * Authors: JavaRush's team, CodeGym's team, Altavista360
 * Version: 1.0.0
 */

/*
 * // JavaRush
 * Задача: Проверка номера заказа на чётность 🛒
 * Ссылка: https://javarush.com/tasks/ru.javarush.java.core.level03.task18
 */

/*
 * // CodeGym
 * Task: Order Number Parity Check 🛒
 * Link: https://codegym.cc/tasks/en.codegym.java.core.level03.task18
 */

/*
 * // JavaRush
 * Условие:
 * В вашем онлайн-магазине всем заказам присваиваются номера. Объявите переменную int orderNumber и присвойте ей любое целое число. Используя тернарный оператор, создайте строковую переменную orderStatus, которая будет иметь значение "Чётный", если номер заказа делится на 2 без остатка, и "Нечётный" в противном случае. Выведите значение orderStatus на экран.
 */

/*
 * // JavaRush
 * Требования:
 * • В программе должна быть объявлена переменная типа int с именем orderNumber и ей должно быть присвоено некоторое целое значение.
 * • Для определения статуса заказа (чётный или нечётный) должен использоваться тернарный оператор (? :).
 * • В программе должна быть объявлена строковая переменная orderStatus, в которую записывается результат работы тернарного оператора.
 * • В условии тернарного оператора должно быть выражение, проверяющее, делится ли orderNumber на 2 без остатка.
 * • Если orderNumber чётный, переменная orderStatus должна принимать значение "Чётный", если нечётный — "Нечётный".
 * • Значение переменной orderStatus должно быть выведено на экран с помощью System.out.println.
 */

/*
 * // JavaRush
 * Черновик:
 * package ru.javarush.java.core.level03.task18;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Объявляем переменную orderNumber и присваиваем ей значение
 *
 *
 *         // Используем тернарный оператор для определения чётности orderNumber
 *
 *
 *         // Выводим результат на экран
 *
 *     }
 * }
 */

// JavaRush
package ru.javarush.java.core.level03.task18;

public class Solution {
    public static void main(String[] args) {
        // Объявляем переменную orderNumber и присваиваем ей значение
        int orderNumber = 123;

        // Используем тернарный оператор для определения чётности orderNumber
        String orderStatus = orderNumber % 2 == 0  ? "Чётный" : "Нечётный";

        // Выводим результат на экран
        System.out.println(orderStatus);
    }
}

/*
 * // JavaRush
 * Правильное решение:
 * // Author: JavaRush's team
 * package ru.javarush.java.core.level03.task18;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Объявляем переменную orderNumber и присваиваем ей значение
 *         int orderNumber = 42;
 *
 *         // Используем тернарный оператор для определения чётности orderNumber
 *         String orderStatus = (orderNumber % 2 == 0) ? "Чётный" : "Нечётный";
 *
 *         // Выводим результат на экран
 *         System.out.println(orderStatus);
 *     }
 * }
 */