## Authors: JavaRush's team, CodeGym's team, Altavista360
## Version: 1.0.0

### JavaRush
## Задача: Негатив
## Ссылка: https://javarush.com/tasks/ru.javarush.python.core.level03.task11

### CodeGym
## Task: Negative
## Link: https://codegym.cc/tasks/en.codegym.python.core.level03.task11

### JavaRush
## Условие:
# Напишите программу, которая запрашивает у пользователя число и проверяет, является ли оно отрицательным. Используйте оператор if для проверки.

### JavaRush
## Требования:
# • Программа должна запрашивать у пользователя ввод числа.
# • Программа должна преобразовать введенное пользователем значение в числовой формат.
# • Программа должна использовать оператор if для проверки, является ли введенное число отрицательным.
# • Программа должна вывести результат проверки пользователю.

### JavaRush
## Черновик:
# # Негатив
# 
# # Напишите программу, которая запрашивает у пользователя число и проверяет, является ли оно отрицательным.
# # Используйте оператор if для проверки.
# 
# # Напишите тут ваш код

### JavaRush
# Негатив

# Напишите программу, которая запрашивает у пользователя число и проверяет, является ли оно отрицательным.
# Используйте оператор if для проверки.

# Напишите тут ваш код

foobar = float(input("Введите число: "))

if foobar < 0:
    print("Число отрицательное")
else:
    print("Число не отрицательное")

### JavaRush
## Правильное решение:
## Author: JavaRush's team
# number = float(input("Введите число: "))
# 
# if number < 0:
#     print("Число отрицательное")
# else:
#     print("Число не является отрицательным")