## Authors: JavaRush's team, CodeGym's team, Altavista360
## Version: 1.0.0

### JavaRush
## Задача: Подсчет времени работы
## Ссылка: https://javarush.com/tasks/ru.javarush.python.core.level15.task16

### CodeGym
## Task: Execution Time Calculation
## Link: https://codegym.cc/tasks/en.codegym.python.core.level15.task16

### JavaRush
## Условие:
# Напиши программу, которая будет считать сколько будет длиться поиск решения для 100 данных тремя алгоритмами. Сложность первого алгоритма 100*n^10. Сложность второго алгоритма 10*2^n. Сложность третьего алгоритма n! . Выведите три этих числа на экран.

### JavaRush
## Требования:
# • Программа должна включать переменную n, которой присваивается значение 100 (сто), представляющее количество данных.
# • Программа должна реализовать расчет времени работы первого алгоритма, сложность которого составляет 100*n^10. Результат этого расчета должен быть сохранен в переменной и выведен на экран.
# • Программа должна реализовать расчет времени работы второго алгоритма, сложность которого составляет 10*2^n. Результат этого расчета должен быть сохранен в переменной и выведен на экран.
# • Программа должна реализовать расчет времени работы третьего алгоритма, сложность которого составляет n! (факториал n). Результат этого расчета должен быть сохранен в переменной и выведен на экран.
# • Программа должна вывести результаты расчетов времени работы для всех трех алгоритмов на экран в читаемом формате.

### JavaRush
## Черновик:
# # Подсчет времени работы
#
# # Напиши программу, которая будет считать сколько будет длиться поиск решения для 100 данных тремя алгоритмами.
# # Сложность первого алгоритма 100*n^10.
# # Сложность второго алгоритма 10*2^n.
# # Сложность третьего алгоритма n! .
# # Выведите три этих числа на экран.
#
# # Напишите тут ваш код

### JavaRush
# Подсчет времени работы

# Напиши программу, которая будет считать сколько будет длиться поиск решения для 100 данных тремя алгоритмами.
# Сложность первого алгоритма 100*n^10.
# Сложность второго алгоритма 10*2^n.
# Сложность третьего алгоритма n! .
# Выведите три этих числа на экран.

# Напишите тут ваш код

import math

n = 100
foo = 100 * n ** 10
bar = 10 * (2 ** n)
baz = math.factorial(n)
print(f"Время работы 1-го алгоритма: {foo}")
print(f"Время работы 2-го алгоритма: {bar}")
print(f"Время работы 3-его алгоритма: {baz}")

### JavaRush
## Правильное решение:
## Author: JavaRush's team
# import math
#
# n = 100
#
# # Сложность первого алгоритма: 100 * n^10
# first_algorithm_time = 100 * n ** 10
#
# # Сложность второго алгоритма: 10 * 2^n
# second_algorithm_time = 10 * (2 ** n)
#
# # Сложность третьего алгоритма: n!
# third_algorithm_time = math.factorial(n)
#
# print(f"Время работы первого алгоритма: {first_algorithm_time}")
# print(f"Время работы второго алгоритма: {second_algorithm_time}")
# print(f"Время работы третьего алгоритма: {third_algorithm_time}")