## Authors: JavaRush's team, CodeGym's team, Altavista360
## Version: 1.0.0

### JavaRush
## Задача: Создаем свой массив
## Ссылка: https://javarush.com/tasks/ru.javarush.python.core.level15.task11

### CodeGym
## Task: Creating Your Own Array
## Link: https://codegym.cc/tasks/en.codegym.python.core.level15.task11

### JavaRush
## Условие:
# Создай массив с использованием библиотеки numpy. Добавь в него 10 случайных чисел от 0 до 1000. Отсортируй и выведи на экран. Класс list использовать нельзя.

### JavaRush
## Требования:
# • Программа должна импортировать библиотеку numpy для создания и работы с массивом.
# • Программа должна создать массив с использованием функции numpy для генерации 10 случайных чисел в диапазоне от 0 до 1000.
# • Программа должна отсортировать созданный массив с помощью функции сортировки из библиотеки numpy.
# • Программа должна вывести отсортированный массив на экран, чтобы пользователь мог увидеть результат.

### JavaRush
## Черновик:
# # Создаем свой массив
#
# # Создай массив с использованием библиотеки numpy.
# # Добавь в него 10 случайных чисел от 0 до 1000. Отсортируй и выведи на экран.
# # Класс list использовать нельзя.
#
# # Напишите тут ваш код

### JavaRush
# Создаем свой массив

# Создай массив с использованием библиотеки numpy.
# Добавь в него 10 случайных чисел от 0 до 1000. Отсортируй и выведи на экран.
# Класс list использовать нельзя.

# Напишите тут ваш код
import numpy as np

foo = np.random.randint(0, 1001, 10)
bar = np.sort(foo)
print(bar)

### JavaRush
## Правильное решение:
## Author: JavaRush's team
# import numpy as np
#
# # Создаем массив из 10 случайных чисел от 0 до 1000
# random_array = np.random.randint(0, 1001, 10)
#
# # Сортируем массив
# sorted_array = np.sort(random_array)
#
# # Выводим отсортированный массив
# print(sorted_array)