/*
 * Authors: JavaRush's team, CodeGym's team, Altavista360
 * Version: 1.0.0
 */

/*
 * // JavaRush
 * Задача: Суммирование результатов в игре 🕹️
 * Ссылка: https://javarush.com/tasks/ru.javarush.java.core.level02.task12
 */

/*
 * // CodeGym
 * Task: Summing game scores 🕹️
 * Link: https://codegym.cc/tasks/en.codegym.java.core.level02.task12
 */

/*
 * // JavaRush
 * Условие:
 * Вы записываете очки за каждый раунд игры, но они приходят в виде текста.
 * Создайте две переменные типа String, каждая из которых содержит отрицательное число, например, "-10" и "-25".
 * Преобразуйте обе строки в числа, сложите их между собой, чтобы получить общий счёт, и выведите результат на экран.
 */

/*
 * // JavaRush
 * Требования:
 * • В программе должны быть объявлены две переменные типа String, содержащие отрицательные числа (например, "-10" и "-25").
 * • Обе строковые переменные должны быть преобразованы в числовой тип int с помощью соответствующего метода преобразования.
 * • Преобразованные в int значения должны быть сложены между собой для получения общего счёта.
 * • Результат суммирования (общий счёт) должен быть выведен на экран.
 */

/*
 * // JavaRush
 * Черновик:
 * package ru.javarush.java.core.level02.task12;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Очки приходят как текстовые строки с отрицательными числами
 *
 *
 *         // Преобразуем строки в числа типа int
 *
 *
 *         // Складываем результаты двух раундов
 *
 *
 *         // Выводим общий счёт на экран
 *
 *     }
 * }
 */

// JavaRush
package ru.javarush.java.core.level02.task12;

public class Solution {
    public static void main(String[] args) {
        // Очки приходят как текстовые строки с отрицательными числами
        String foo = "-10", bar = "-25";

        // Преобразуем строки в числа типа int
        int score1 = Integer.parseInt(foo), score2 = Integer.parseInt(bar);

        // Складываем результаты двух раундов
        int totalScore = score1 + score2;

        // Выводим общий счёт на экран
        System.out.println(totalScore);
    }
}

/*
 * // JavaRush
 * Правильное решение:
 * // Author: JavaRush's team
 * package ru.javarush.java.core.level02.task12;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Очки приходят как текстовые строки с отрицательными числами
 *         String scoreRound1Text = "-10";
 *         String scoreRound2Text = "-25";
 *
 *         // Преобразуем строки в числа типа int
 *         int scoreRound1 = Integer.parseInt(scoreRound1Text);
 *         int scoreRound2 = Integer.parseInt(scoreRound2Text);
 *
 *         // Складываем результаты двух раундов
 *         int totalScore = scoreRound1 + scoreRound2;
 *
 *         // Выводим общий счёт на экран
 *         System.out.println(totalScore);
 *     }
 * }
 */