## Authors: JavaRush's team, CodeGym's team, Altavista360
## Version: 1.0.0

### JavaRush
## Задача: Преобразуем число в десятичное
## Ссылка: https://javarush.com/tasks/ru.javarush.python.core.level15.task10

### CodeGym
## Task: Convert a number to decimal
## Link: https://codegym.cc/tasks/en.codegym.python.core.level15.task10

### JavaRush
## Условие:
# Напишите программу, которая принимает двоичное целое число от пользователя, преобразует его в десятичное представление и показывает, как оно будет храниться в памяти. В программе также должно быть отображено количество байтов, занимаемое числом.

### JavaRush
## Требования:
# • Программа должна запрашивать ввод двоичного целого числа от пользователя и сохранять это значение в переменной.
# • Программа должна включать функцию или блок кода, который преобразует введенное двоичное число в десятичное представление.
# • Программа должна вывести на экран полученной число.
# • Программа должна вычислить и отобразить количество байтов, используемых для хранения числа в памяти.

### JavaRush
## Черновик:
# # Преобразуем число в десятичное
# # Напишите программу, которая принимает двоичное целое число от пользователя,
# # преобразует его в десятичное представление и показывает, как оно будет храниться в памяти.
# # В программе также должно быть отображено количество байтов, занимаемое числом.
# # Напишите тут ваш код

### JavaRush
# Преобразуем число в десятичное
# Напишите программу, которая принимает двоичное целое число от пользователя,
# преобразует его в десятичное представление и показывает, как оно будет храниться в памяти.
# В программе также должно быть отображено количество байтов, занимаемое числом.
# Напишите тут ваш код
foo = input("Введите двоичное число: ")
bar = int(foo, 2)
baz = (bar.bit_length() + 7) // 8
print(f"Десятичное представление: {bar}")
print(f"Количество байтов: {baz}")
print(f"Хранение в памяти: {bar.to_bytes(baz, 'big')}")

### JavaRush
## Правильное решение:
## Author: JavaRush's team
# binary_str = input("Введите двоичное число: ")
# decimal_number = int(binary_str, 2)
#
# # Вычисляем количество байтов
# num_bytes = (decimal_number.bit_length() + 7) // 8
#
# print(f"Десятичное представление: {decimal_number}")
# print(f"Количество байтов: {num_bytes}")
# print(f"Хранение в памяти: {decimal_number.to_bytes(num_bytes, 'big')}")