/*
 * Authors: JavaRush's team, CodeGym's team, Altavista360
 * Version: 1.0.0
 */

/*
 * // JavaRush
 * Задача: Интерактивный терминал 💻
 * Ссылка: https://javarush.com/tasks/ru.javarush.java.core.level04.task11
 */

/*
 * // CodeGym
 * Task: Interactive terminal 💻
 * Link: https://codegym.cc/tasks/en.codegym.java.core.level04.task11
 */

/*
 * // JavaRush
 * Условие:
 * Реализуйте простое текстовое меню для командной строки с помощью do-while. Программа должна выводить на экран:
 * Меню:
 * 1. Вывести приветствие
 * 2. Выйти
 * Пользователь вводит номер пункта меню. Если выбран пункт 1, программа выводит "Привет!" и снова показывает меню. Если выбран пункт 2, программа завершает работу. Для ввода используйте Scanner.
 */

/*
 * // JavaRush
 * Требования:
 * • Меню должно отображаться с помощью цикла do-while, чтобы повторять показ меню до выбора выхода.
 * • В каждом цикле программа должна выводить на экран текст меню с двумя пунктами: "1. Вывести приветствие" и "2. Выйти".
 * • Для ввода номера пункта меню программа должна использовать класс Scanner.
 * • Если пользователь выбирает пункт 1, программа должна вывести "Привет!" и снова показать меню; если пункт 2 — завершить работу программы.
 */

/*
 * // JavaRush
 * Черновик:
 * package ru.javarush.java.core.level04.task11;
 *
 * import java.util.Scanner;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Создаем Scanner для чтения ввода пользователя
 *
 *
 *         // переменная для хранения выбранного пункта меню
 *
 *
 *         // Используем do-while, чтобы меню показывалось хотя бы один раз и повторялось до выбора "Выйти"
 *         do {
 *             // Печатаем меню в каждом цикле
 *
 *             // Считываем номер выбранного пункта
 *
 *
 *             // Обработка выбора
 *             if (/* условие */) {
 *
 *             }
 *             // При выборе 2 цикл завершится благодаря условию while ниже
 *             // Для других значений просто снова покажем меню
 *         } while (/* условие */);
 *     }
 * }
 */

// JavaRush
package ru.javarush.java.core.level04.task11;

import java.util.Scanner;

public class Solution {
    public static void main(String[] args) {
        // Создаем Scanner для чтения ввода пользователя
        Scanner userInput = new Scanner(System.in);

        // переменная для хранения выбранного пункта меню
        int inputElementMenu;

        // Используем do-while, чтобы меню показывалось хотя бы один раз и повторялось до выбора "Выйти"
        do {
            // Печатаем меню в каждом цикле
        System.out.println("Меню:");
        System.out.println("1. Вывести приветствие");
        System.out.println("2. Выйти");
        System.out.print("Выберите действие: ");
            // Считываем номер выбранного пункта
        inputElementMenu = userInput.nextInt();

            // Обработка выбора
            if (inputElementMenu == 1/* условие */) {
                System.out.println("Привет!");
            }
            // При выборе 2 цикл завершится благодаря условию while ниже
            // Для других значений просто снова покажем меню
        } while (inputElementMenu != 2/* условие */);
    }
}

/*
 * // JavaRush
 * Правильное решение:
 * // Author: JavaRush's team
 * package ru.javarush.java.core.level04.task11;
 *
 * import java.util.Scanner;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Создаем Scanner для чтения ввода пользователя
 *         Scanner console = new Scanner(System.in);
 *
 *         int choice; // переменная для хранения выбранного пункта меню
 *
 *         // Используем do-while, чтобы меню показывалось хотя бы один раз и повторялось до выбора "Выйти"
 *         do {
 *             // Печатаем меню в каждом цикле
 *             System.out.println("Меню:");
 *             System.out.println("1. Вывести приветствие");
 *             System.out.println("2. Выйти");
 *
 *             // Считываем номер выбранного пункта
 *             choice = console.nextInt();
 *
 *             // Обработка выбора
 *             if (choice == 1) {
 *                 System.out.println("Привет!");
 *             }
 *             // При выборе 2 цикл завершится благодаря условию while ниже
 *             // Для других значений просто снова покажем меню
 *         } while (choice != 2);
 *     }
 * }
 */