## Authors: JavaRush's team, CodeGym's team, Altavista360
## Version: 1.0.0

### JavaRush
## Задача: Семицветик
## Ссылка: https://javarush.com/tasks/ru.javarush.python.core.level06.task03

### CodeGym
## Task: Rainbow Flower
## Link: https://codegym.cc/tasks/en.codegym.python.core.level06.task03

### JavaRush
## Условие:
# Напишите программу, которая создает множество из 7 элементов - названий цветов (color). Программа должна вывести все элементы созданного множества на экран.

### JavaRush
## Требования:
# • Программа должна создать множество (например с именем colors), включающее 7 элементов - названия цветов.
# • Программа должна включить в множество строковые значения, представляющие названия семи различных цветов.
# • Программа должна вывести на экран все элементы созданного множества.

### JavaRush
## Черновик:
# # Семицветик
#
# # Напишите программу, которая создает множество из 7 элементов - названий цветов (color).
# # Программа должна вывести все элементы созданного множества на экран.
#
# # Напишите тут ваш код

### JavaRush
# Семицветик

# Напишите программу, которая создает множество из 7 элементов - названий цветов (color).
# Программа должна вывести все элементы созданного множества на экран.

# Напишите тут ваш код

colors = {"Pink", "Purple", "Brown", "Black", "White", "Gray", "Beige"}
for color in colors:
    print(color)

### JavaRush
## Правильное решение:
## Author: JavaRush's team
# colors = {"Red", "Orange", "Yellow", "Green", "Blue", "Indigo", "Violet"}
# for color in colors:
#     print(color)