## Authors: JavaRush's team, CodeGym's team, Altavista360
## Version: 1.0.0

### JavaRush
## Задача: Подсчет времени сортировки
## Ссылка: https://javarush.com/tasks/ru.javarush.python.core.level15.task15

### CodeGym
## Task: Sorting Time Estimation
## Link: https://codegym.cc/tasks/en.codegym.python.core.level15.task15

### JavaRush
## Условие:
# Напиши программу, которая будет считать сколько будет длиться сортировка 1 млрд. чисел тремя алгоритмами. Сложность первого алгоритма 100*n*ln(n). Сложность второго алгоритма 10*n^2. Сложность третьего алгоритма n^3. Выведите три этих числа на экран.

### JavaRush
## Требования:
# • Программа должна включать переменную "n", которой присваивается значение 1 000 000 000, представляющее количество чисел для сортировки.
# • Программа должна вычислять время сортировки по первому алгоритму с вычислительной сложностью 100 * n * ln(n) и сохранять результат в соответствующую переменную.
# • Программа должна вычислять время сортировки по второму алгоритму с вычислительной сложностью 10 * n^2 и сохранять результат в соответствующую переменную.
# • Программа должна вычислять время сортировки по третьему алгоритму с вычислительной сложностью n^3 и сохранять результат в соответствующую переменную.
# • Программа должна выводить на экран три рассчитанных значения, соответствующих временам сортировки для каждого из трех алгоритмов.

### JavaRush
## Черновик:
# # Подсчет времени сортировки
#
# # Напиши программу, которая будет считать сколько будет длиться сортировка 1 млрд. чисел тремя алгоритмами.
# # Сложность первого алгоритма 100*n*ln(n).
# # Сложность второго алгоритма 10*n^2.
# # Сложность третьего алгоритма n^3.
# # Выведите три этих числа на экран.
#
# # Напишите тут ваш код

### JavaRush
# Подсчет времени сортировки

# Напиши программу, которая будет считать сколько будет длиться сортировка 1 млрд. чисел тремя алгоритмами.
# Сложность первого алгоритма 100*n*ln(n).
# Сложность второго алгоритма 10*n^2.
# Сложность третьего алгоритма n^3.
# Выведите три этих числа на экран.

# Напишите тут ваш код

import math

n = 1_000_000_000

foo = 100 * n * math.log(n)
bar = 10 * n ** 2
baz = n ** 3

print(foo)
print(bar)
print(baz)

### JavaRush
## Правильное решение:
## Author: JavaRush's team
# import math
#
# n = 1_000_000_000
#
# time_algorithm_1 = 100 * n * math.log(n)
# time_algorithm_2 = 10 * n ** 2
# time_algorithm_3 = n ** 3
#
# print(time_algorithm_1)
# print(time_algorithm_2)
# print(time_algorithm_3)