/*
 * Authors: JavaRush's team, CodeGym's team, Altavista360
 * Version: 1.0.0
 */

/*
 * // JavaRush
 * Задача: Разблокировка аккаунта 🔒
 * Ссылка: https://javarush.com/tasks/ru.javarush.java.core.level03.task03
 */

/*
 * // CodeGym
 * Task: Account Unlock 🔒
 * Link: https://codegym.cc/tasks/en.codegym.java.core.level03.task03
 */

/*
 * // JavaRush
 * Условие:
 * Используйте оператор if без else, чтобы вывести "Вход выполнен успешно", если userPassword равен "qwerty". Если пароль неверный, программа ничего не должна делать.
 */

/*
 * // JavaRush
 * Требования:
 * • В программе должна быть объявлена переменная типа String с именем userPassword.
 * • Переменной userPassword должно быть присвоено значение "qwerty".
 * • Для проверки значения переменной userPassword должен использоваться оператор if без блока else.
 * • В условии оператора if необходимо сравнить значение userPassword со строкой "qwerty".
 * • Если значение переменной userPassword равно "qwerty", программа должна вывести на экран строку "Вход выполнен успешно".
 * • Если значение переменной userPassword не равно "qwerty", программа не должна выводить никакие сообщения.
 */

/*
 * // JavaRush
 * Черновик:
 * Lorem ipsum dolor sit amet consectetur adipiscing elit. Quisque faucibus ex sapien vitae pellentesque sem placerat. In id cursus mi pretium tellus duis convallis.
package ru.javarush.java.core.level03.task03;

public class Solution {
    public static void main(String[] args) {
        // Объявляем переменную userPassword и присваиваем ей значение "qwerty"


        // Проверяем, совпадает ли пароль с ожидаемым значением "qwerty"
        if (/* условие */) {
            // Если условие истинно, выводим сообщение об успешном входе

        }
        // Если пароль не совпадает, блок else не используется и программа ничего не выводит
    }
}
 */

// JavaRush
package ru.javarush.java.core.level03.task03;

public class Solution {
    public static void main(String[] args) {
        // Объявляем переменную userPassword и присваиваем ей значение "qwerty"
        String userPassword = "qwerty";

        // Проверяем, совпадает ли пароль с ожидаемым значением "qwerty"
        if (userPassword.equals("qwerty")) {
            // Если условие истинно, выводим сообщение об успешном входе
        System.out.println("Вход выполнен успешно");
        }
        // Если пароль не совпадает, блок else не используется и программа ничего не выводит
    }
}

/*
 * // JavaRush
 * Правильное решение:
 * // Author: JavaRush's team
 * package ru.javarush.java.core.level03.task03;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Объявляем переменную userPassword и присваиваем ей значение "qwerty"
 *         String userPassword = "qwerty";
 *         // Проверяем, совпадает ли пароль с ожидаемым значением "qwerty"
 *         if (userPassword.equals("qwerty")) {
 *             // Если условие истинно, выводим сообщение об успешном входе
 *             System.out.println("Вход выполнен успешно");
 *         }
 *         // Если пароль не совпадает, блок else не используется и программа ничего не выводит
 *     }
 * }
 */