/*
 * Authors: JavaRush's team, CodeGym's team, Altavista360
 * Version: 1.0.0
 */

/*
 * // JavaRush
 * Задача: Ввод PIN-кода 💳
 * Ссылка: https://javarush.com/tasks/ru.javarush.java.core.level04.task10
 */

/*
 * // CodeGym
 * Task: PIN Code Input 💳
 * Link: https://codegym.cc/tasks/en.codegym.java.core.level04.task10
 */

/*
 * // JavaRush
 * Условие:
 * Вы разрабатываете интерфейс для банкомата. Банкомат должен запрашивать PIN-код, пока пользователь не введёт четырёхзначное положительное число.
 * Используйте цикл do-while и Scanner, чтобы программа запрашивала ввод, пока пользователь не введёт число, строго большее 0.
 * После ввода корректного числа выведите на экран текст: "PIN-код принят".
 */

/*
 * // JavaRush
 * Требования:
 * • Программа должна использовать цикл do-while для организации повторного запроса PIN-кода.
 * • Для ввода данных с клавиатуры должен использоваться класс Scanner.
 * • Введённый PIN-код должен быть четырёхзначным положительным числом (от 1000 до 9999 включительно).
 * • Программа должна повторять запрос PIN-кода до тех пор, пока пользователь не введёт корректное четырёхзначное положительное число.
 * • После ввода корректного PIN-кода программа должна вывести на экран сообщение "PIN-код принят".
 */

/*
 * // JavaRush
 * Черновик:
 * package ru.javarush.java.core.level04.task10;
 *
 * import java.util.Scanner;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Создаем Scanner для чтения данных с клавиатуры
 *
 *
 *         // Используем do-while, чтобы запросить PIN хотя бы один раз
 *         // и повторять ввод, пока число не будет в диапазоне 1000..9999
 *         do {
 *             // Запрос ввода PIN-кода
 *
 *             // читаем целое число
 *
 *         } while (/* условие */);
 *
 *         // Выводим сообщение о принятии PIN-кода
 *
 *     }
 * }
 */

// JavaRush
package ru.javarush.java.core.level04.task10;

import java.util.Scanner;

public class Solution {
    public static void main(String[] args) {
        // Создаем Scanner для чтения данных с клавиатуры
        Scanner userInput = new Scanner(System.in);
        int pinCode;
        // Используем do-while, чтобы запросить PIN хотя бы один раз
        // и повторять ввод, пока число не будет в диапазоне 1000..9999
        do {
            // Запрос ввода PIN-кода
            System.out.println("Установите PIN-код (от 1000 до 9999 включительно): ");
            // читаем целое число
            pinCode = userInput.nextInt();
        } while (pinCode < 1000 || pinCode > 9999/* условие */);
        // Выводим сообщение о принятии PIN-кода
        System.out.println("PIN-код принят");
    }
}

/*
 * // JavaRush
 * Правильное решение:
 * // Author: JavaRush's team
 * package ru.javarush.java.core.level04.task10;
 *
 * import java.util.Scanner;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Создаем Scanner для чтения данных с клавиатуры
 *         Scanner console = new Scanner(System.in);
 *
 *         int pin;
 *         // Используем do-while, чтобы запросить PIN хотя бы один раз
 *         // и повторять ввод, пока число не будет в диапазоне 1000..9999
 *         do {
 *             System.out.println("Введите PIN-код:");
 *             pin = console.nextInt(); // читаем целое число
 *         } while (pin < 1000 || pin > 9999);
 *
 *         System.out.println("PIN-код принят");
 *     }
 * }
 */