/*
 * Authors: JavaRush's team, CodeGym's team, Altavista360
 * Version: 1.0.0
 */

/*
 * // JavaRush
 * Задача: Обработка данных из формы 📝
 * Ссылка: https://javarush.com/tasks/ru.javarush.java.core.level02.task08
 */

/*
 * // CodeGym
 * Task: Processing form data 📝
 * Link: https://codegym.cc/tasks/en.codegym.java.core.level02.task08
 */

/*
 * // JavaRush
 * Условие:
 * Вы получаете данные из формы, которые могут содержать лишние пробелы и неверный регистр.
 * Создайте переменную типа String с именем cityName и присвойте ей значение "Osgiliath" с несколькими пробелами в начале и конце (минимум один пробел в начале и минимум один пробел в конце).
 * Выведите на экран длину строки до и после удаления пробелов с помощью метода trim().
 * Затем выведите название города в верхнем и нижнем регистре.
 */

/*
 * // JavaRush
 * Требования:
 * • В программе должна быть объявлена переменная типа String с именем cityName.
 * • Переменной cityName должно быть присвоено значение "Osgiliath" с несколькими пробелами в начале и конце (минимум один пробел в начале и минимум один пробел в конце).
 * • На экран должна быть выведена длина строки cityName до удаления пробелов методом trim().
 * • Должен быть использован метод trim() для удаления пробелов в начале и конце строки cityName.
 * • На экран должна быть выведена длина строки cityName после применения метода trim().
 * • На экран должно быть выведено название города в верхнем регистре (используя метод toUpperCase()).
 * • На экран должно быть выведено название города в нижнем регистре (используя метод toLowerCase()).
 */

/*
 * // JavaRush
 * Черновик:
 * package ru.javarush.java.core.level02.task08;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Объявляем строковую переменную с лишними пробелами в начале и конце
 *
 *
 *         // Выводим длину строки до удаления пробелов
 *
 *
 *         // Удаляем пробелы по краям и сохраняем результат обратно в переменную
 *
 *
 *         // Выводим длину строки после удаления пробелов
 *
 *
 *         // Выводим название города в верхнем и нижнем регистре
 *
 *
 *     }
 * }
 */

// JavaRush
package ru.javarush.java.core.level02.task08;

public class Solution {
    public static void main(String[] args) {
        // Объявляем строковую переменную с лишними пробелами в начале и конце
        String cityName = "  Osgiliath   ";

        // Выводим длину строки до удаления пробелов
        System.out.println(cityName.length());

        // Удаляем пробелы по краям и сохраняем результат обратно в переменную
        cityName = cityName.trim();

        // Выводим длину строки после удаления пробелов
        System.out.println(cityName.length());

        // Выводим название города в верхнем и нижнем регистре
        System.out.println(cityName.toUpperCase());
        System.out.println(cityName.toLowerCase());
    }
}

/*
 * // JavaRush
 * Правильное решение:
 * // Author: JavaRush's team
 * package ru.javarush.java.core.level02.task08;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Объявляем строковую переменную с лишними пробелами в начале и конце
 *         String cityName = "  Osgiliath  ";
 *
 *         // Выводим длину строки до удаления пробелов
 *         System.out.println(cityName.length());
 *
 *         // Удаляем пробелы по краям и сохраняем результат обратно в переменную
 *         cityName = cityName.trim();
 *
 *         // Выводим длину строки после удаления пробелов
 *         System.out.println(cityName.length());
 *
 *         // Выводим название города в верхнем и нижнем регистре
 *         System.out.println(cityName.toUpperCase());
 *         System.out.println(cityName.toLowerCase());
 *     }
 * }
 */