/*
 * Authors: JavaRush's team, CodeGym's team, Altavista360
 * Version: 1.0.0
 */

/*
 * // JavaRush
 * Задача: Обратный отсчет перед стартом 🚀
 * Ссылка: https://javarush.com/tasks/ru.javarush.java.core.level04.task01
 */

/*
 * // CodeGym
 * Task: Countdown Before Launch 🚀
 * Link: https://codegym.cc/tasks/en.codegym.java.core.level04.task01
 */

/*
 * // JavaRush
 * Условие:
 * Представьте, что вы пишете программу для запуска космического корабля. Создайте цикл while, который выводит на экран обратный отсчет от 3 до 1. Каждое число должно быть на новой строке. После этого выведите сообщение «Старт!».
 */

/*
 * // JavaRush
 * Требования:
 * • В программе должен использоваться цикл while для организации обратного отсчета.
 * • Цикл while должен выводить числа 3, 2 и 1 в указанном порядке, каждое на новой строке.
 * • После завершения цикла на экран должно быть выведено сообщение "Старт!".
 * • Каждое число и сообщение "Старт!" должны выводиться с новой строки.
 */

/*
 * // JavaRush
 * Черновик:
 * package ru.javarush.java.core.level04.task01;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Инициализируем переменную для обратного отсчета
 *
 *
 *         // Цикл while выполняется, пока значение countdown больше 0
 *         while (/* условие */) {
 *             // Выводим текущее значение countdown
 *
 *             // Уменьшаем значение countdown на 1
 *
 *         }
 *
 *         // После завершения цикла выводим сообщение "Старт!"
 *
 *     }
 * }
 */

// JavaRush
package ru.javarush.java.core.level04.task01;

public class Solution {
    public static void main(String[] args) {
        // Инициализируем переменную для обратного отсчета
        int countdown = 3;

        // Цикл while выполняется, пока значение countdown больше 0
        while (countdown > 0) {
            // Выводим текущее значение countdown
        System.out.println(countdown);
            // Уменьшаем значение countdown на 1
        countdown = countdown - 1;
        }

        // После завершения цикла выводим сообщение "Старт!"
        System.out.println("Старт!");
    }
}

/*
 * // JavaRush
 * Правильное решение:
 * // Author: JavaRush's team
 * package ru.javarush.java.core.level04.task01;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Инициализируем переменную для обратного отсчета
 *         int countdown = 3;
 *
 *         // Цикл while выполняется, пока значение countdown больше 0
 *         while (countdown > 0) {
 *             // Выводим текущее значение countdown
 *             System.out.println(countdown);
 *
 *             // Уменьшаем значение countdown на 1
 *             countdown--;
 *         }
 *
 *         // После завершения цикла выводим сообщение "Старт!"
 *         System.out.println("Старт!");
 *     }
 * }
 */