## Authors: JavaRush's team, CodeGym's team, Altavista360
## Version: 1.0.0

### JavaRush
## Задача: От sep до end
## Ссылка: https://javarush.com/tasks/ru.javarush.python.core.level03.task20

### CodeGym
## Task: From sep to end
## Link: https://codegym.cc/tasks/en.codegym.python.core.level03.task20

### JavaRush
## Условие:
# Напишите программу, которая выводит числа от 1 до 5 в одной строке, разделяя их звездочками. Затем программа должна вывести сообщение "Конец программы." на той же строке после всех чисел. Используйте параметры sep и end в функции print().

### JavaRush
## Требования:
# • Программа должна использовать функцию print для вывода чисел от 1 до 5, разделяя их звездочками.
# • Программа должна использовать параметр sep в функции print для разделения чисел звездочками.
# • Программа должна использовать параметр end в функции print для добавления сообщения "Конец программы." после вывода чисел на той же строке.
# • Программа должна вывести числа от 1 до 5 в одной строке, разделяя их звездочками, и затем вывести сообщение "Конец программы." на той же строке.

### JavaRush
## Черновик:
# # От sep до end
# 
# # Напишите программу, которая выводит числа от 1 до 5 в одной строке, разделяя их звездочками.
# # Затем программа должна вывести сообщение "Конец программы." на той же строке после всех чисел.
# # Используйте параметры sep и end в функции print().
# 
# # Напишите тут ваш код

### JavaRush
# От sep до end

# Напишите программу, которая выводит числа от 1 до 5 в одной строке, разделяя их звездочками.
# Затем программа должна вывести сообщение "Конец программы." на той же строке после всех чисел.
# Используйте параметры sep и end в функции print().

# Напишите тут ваш код

print(1, 2, 3, 4, 5, sep='*', end=' Конец программы.')

### JavaRush
## Правильное решение:
## Author: JavaRush's team
# print(1, 2, 3, 4, 5, sep='*', end=' Конец программы.')