/*
 * Authors: JavaRush's team, CodeGym's team, Altavista360
 * Version: 1.0.0
 */

/*
 * // JavaRush
 * Задача: Разные счета в банке 🏦
 * Ссылка: https://javarush.com/tasks/ru.javarush.java.core.level02.task16
 */

/*
 * // CodeGym
 * Task: Different bank accounts 🏦
 * Link: https://codegym.cc/tasks/en.codegym.java.core.level02.task16
 */

/*
 * // JavaRush
 * Условие:
 * Представьте, что вы управляете двумя счетами в банке.
 * Объявите две переменные int: account1 со значением 100 и account2 со значением 200.
 * Затем переведите деньги со счета 1 на счет 2: присвойте account2 значение account2 плюс account1, а account1 присвойте 0.
 * После этого на счет 1 приходит бонус в размере 50. Увеличьте account1 на 50.
 * Выведите значения обеих переменных на экран.
 */

/*
 * // JavaRush
 * Требования:
 * • Должны быть объявлены две переменные типа int с именами account1 и account2.
 * • Переменная account1 должна быть инициализирована значением 100, а account2 — значением 200.
 * • Значение переменной account2 должно быть увеличено на значение переменной account1, а переменной account1 присвоено значение 0.
 * • Переменная account1 должна быть увеличена на 50 после операции присваивания.
 * • Значения обеих переменных должны быть выведены на экран после всех операций.
 */

/*
 * // JavaRush
 * Черновик:
 * package ru.javarush.java.core.level02.task16;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Объявляем две переменные типа int и инициализируем их начальными значениями
 *
 *
 *         // Присваиваем переменной account2 значение account2 + account1 (переводим деньги)
 *
 *
 *         // На счет1 приходит бонус в размере 50 и мы увеличиваем account1 на 50
 *
 *
 *         // Выводим на экран конечные значения обеих переменных
 *
 *
 *     }
 * }
 */

// JavaRush
package ru.javarush.java.core.level02.task16;

public class Solution {
    public static void main(String[] args) {
        // Объявляем две переменные типа int и инициализируем их начальными значениями
        int account1 = 100, account2 = 200;

        // Присваиваем переменной account2 значение account2 + account1 (переводим деньги)
        account2 = account2 + account1;
        account1 = account1 - account1;

        // На счет1 приходит бонус в размере 50 и мы увеличиваем account1 на 50
        account1 = account1 + 50;

        // Выводим на экран конечные значения обеих переменных
        System.out.println(account1);
        System.out.println(account2);
    }
}

/*
 * // JavaRush
 * Правильное решение:
 * // Author: JavaRush's team
 * package ru.javarush.java.core.level02.task16;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Объявляем две переменные типа int и инициализируем их начальными значениями
 *         int account1 = 100;
 *         int account2 = 200;
 *
 *         // Переводим деньги с account1 на account2
 *         account2 += account1;
 *         account1 = 0;
 *
 *         // На счет 1 приходит бонус в размере 50 и мы увеличиваем account1 на 50
 *         account1 += 50;
 *
 *         // Выводим на экран конечные значения обеих переменных
 *         System.out.println(account1);
 *         System.out.println(account2);
 *     }
 * }
 */