/*
 * Authors: JavaRush's team, CodeGym's team, Altavista360
 * Version: 1.0.0
 */

/*
 * // JavaRush
 * Задача: Программа лояльности в магазине 🛍️
 * Ссылка: https://javarush.com/tasks/ru.javarush.java.core.level03.task08
 */

/*
 * // CodeGym
 * Task: Store loyalty program 🛍️
 * Link: https://codegym.cc/tasks/en.codegym.java.core.level03.task08
 */

/*
 * // JavaRush
 * Условие:
 * Вы создаёте программу лояльности, которая определяет размер скидки.
 * Попросите пользователя ввести возраст и ответить, есть ли у него клубная карта (ответом "да" или "нет").
 * Если возраст больше или равен 65, программа должна вывести «Ваша скидка: 20%.»
 * Если возраст меньше 65, но у пользователя есть клубная карта, программа должна вывести «Ваша скидка: 10%.»
 * В остальных случаях программа должна вывести «Скидки нет.»
 */

/*
 * // JavaRush
 * Требования:
 * • Программа должна запросить у пользователя ввод возраста.
 * • Программа должна запросить у пользователя, есть ли у него клубная карта, ожидая ответ "да" или "нет".
 * • Программа должна использовать вложенные if-операторы для проверки возраста и наличия клубной карты.
 * • Если возраст пользователя больше или равен 65, программа должна вывести "Ваша скидка: 20%.".
 * • Если возраст пользователя меньше 65 и у него есть клубная карта, программа должна вывести "Ваша скидка: 10%.".
 * • Во всех остальных случаях программа должна вывести "Скидки нет.".
 */

/*
 * // JavaRush
 * Черновик:
 * package ru.javarush.java.core.level03.task08;
 *
 * import java.util.Scanner;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Создаем объект Scanner для ввода данных с клавиатуры
 *         Scanner console = new Scanner(System.in);
 *
 *         // Запрашиваем возраст пользователя
 *         System.out.println("Введите ваш возраст:");
 *         int age = console.nextInt();
 *         console.nextLine(); // Считываем оставшийся символ новой строки
 *
 *         // Запрашиваем наличие клубной карты
 *         System.out.println("У вас есть клубная карта? (да/нет):");
 *         String hasClubCard = console.nextLine().trim().toLowerCase();
 *
 *         // Проверяем условия для определения скидки
 *         if (/* условие */) {
 *             // Если возраст 65 или больше, предоставляем скидку 20%
 *
 *         } else {
 *             // Если возраст меньше 65, проверяем наличие клубной карты
 *             if (/* условие */) {
 *                 // Если есть клубная карта, предоставляем скидку 10%
 *
 *             } else {
 *                 // Во всех остальных случаях скидки нет
 *
 *             }
 *         }
 *     }
 * }
 */

// JavaRush
package ru.javarush.java.core.level03.task08;

import java.util.Scanner;

public class Solution {
    public static void main(String[] args) {
        // Создаем объект Scanner для ввода данных с клавиатуры
        Scanner console = new Scanner(System.in);

        // Запрашиваем возраст пользователя
        System.out.println("Введите ваш возраст:");
        int age = console.nextInt();
        console.nextLine(); // Считываем оставшийся символ новой строки

        // Запрашиваем наличие клубной карты
        System.out.println("У вас есть клубная карта? (да/нет):");
        String hasClubCard = console.nextLine().trim().toLowerCase();

        // Проверяем условия для определения скидки
        if (age >= 65) {
            // Если возраст 65 или больше, предоставляем скидку 20%
            System.out.println("Ваша скидка: 20%.");
        } else {
            // Если возраст меньше 65, проверяем наличие клубной карты
            if (hasClubCard.equals("да")) {
                // Если есть клубная карта, предоставляем скидку 10%
            System.out.println("Ваша скидка: 10%.");
            } else {
                // Во всех остальных случаях скидки нет
            System.out.println("Скидки нет.");
            }
        }
    }
}

/*
 * // JavaRush
 * Правильное решение:
 * // Author: JavaRush's team
 * package ru.javarush.java.core.level03.task08;
 *
 * import java.util.Scanner;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Создаем объект Scanner для ввода данных с клавиатуры
 *         Scanner console = new Scanner(System.in);
 *
 *         // Запрашиваем возраст пользователя
 *         System.out.println("Введите ваш возраст:");
 *         int age = console.nextInt();
 *         console.nextLine(); // Считываем оставшийся символ новой строки
 *
 *         // Запрашиваем наличие клубной карты
 *         System.out.println("У вас есть клубная карта? (да/нет):");
 *         String hasClubCard = console.nextLine().trim().toLowerCase();
 *
 *         // Проверяем условия для определения скидки
 *         if (age >= 65) {
 *             // Если возраст 65 или больше, предоставляем скидку 20%
 *             System.out.println("Ваша скидка: 20%.");
 *         } else {
 *             // Если возраст меньше 65, проверяем наличие клубной карты
 *             if (hasClubCard.equals("да")) {
 *                 // Если есть клубная карта, предоставляем скидку 10%
 *                 System.out.println("Ваша скидка: 10%.");
 *             } else {
 *                 // Во всех остальных случаях скидки нет
 *                 System.out.println("Скидки нет.");
 *             }
 *         }
 *     }
 * }
 */