## Authors: JavaRush's team, CodeGym's team, Altavista360
## Version: 1.0.0

### JavaRush
## Задача: Двоичное представление
## Ссылка: https://javarush.com/tasks/ru.javarush.python.core.level15.task09

### CodeGym
## Task: Binary Representation
## Link: https://codegym.cc/tasks/en.codegym.python.core.level15.task09

### JavaRush
## Условие:
# Напишите программу, которая принимает целое число от пользователя, преобразует его в двоичное представление и показывает, как оно будет храниться в памяти. В программе также должно быть отображено количество байтов, занимаемое числом.

### JavaRush
## Требования:
# • Программа должна запрашивать у пользователя ввод целого числа и сохранять его в переменной.
# • Программа должна преобразовывать введенное пользователем целое число в его двоичное представление в виде строки.
# • Программа должна выводить на экран двоичное представление введенного числа.
# • Программа должна вычислять количество байтов, которое занимает введенное число в памяти, и отображать это значение на экране.
# • Отрицательные числа можно не учитывать.

### JavaRush
## Черновик:
# # Двоичное представление
#
# # Напишите программу, которая принимает целое число от пользователя,
# # преобразует его в двоичное представление и показывает, как оно будет храниться в памяти.
# # В программе также должно быть отображено количество байтов, занимаемое числом.
#
# # Напишите тут ваш код

### JavaRush
# Двоичное представление

# Напишите программу, которая принимает целое число от пользователя,
# преобразует его в двоичное представление и показывает, как оно будет храниться в памяти.
# В программе также должно быть отображено количество байтов, занимаемое числом.

# Напишите тут ваш код
foo = int(input("Введите целое число: "))
bar = bin(foo)[2:]
baz = (foo.bit_length() + 7) // 8
print(f"Двоичное представление: {bar}")
print(f"Количество байтов: {baz}")

### JavaRush
## Правильное решение:
## Author: JavaRush's team
# number = int(input("Введите целое число: "))
# binary_representation = bin(number)[2:]
# byte_count = (number.bit_length() + 7) // 8
# print(f"Двоичное представление: {binary_representation}")
# print(f"Количество байтов: {byte_count}")