/*
 * Authors: JavaRush's team, CodeGym's team, Altavista360
 * Version: 1.0.0
 */

/*
 * // JavaRush
 * Задача: Создание полного имени 👤
 * Ссылка: https://javarush.com/tasks/ru.javarush.java.core.level02.task06
 */

/*
 * // CodeGym
 * Task: Creating a Full Name 👤
 * Link: https://codegym.cc/tasks/en.codegym.java.core.level02.task06
 */

/*
 * // JavaRush
 * Условие:
 * Вы создаете профиль для пользователя. Создайте две переменные типа String: firstName со значением "Luke" и lastName со значением "Skywalker". Объедините их в одну строку, добавив пробел между именем и фамилией, и выведите результат на экран.
 */

/*
 * // JavaRush
 * Требования:
 * • В программе должны быть объявлены две переменные типа String: firstName и lastName.
 * • Переменной firstName должно быть присвоено значение "Luke", а переменной lastName — значение "Skywalker".
 * • Переменные firstName и lastName должны быть объединены в одну строку с пробелом между ними.
 * • Результирующая строка с полным именем должна быть выведена на экран.
 */

/*
 * // JavaRush
 * Черновик:
 * package ru.javarush.java.core.level02.task06;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Объявляем переменные и присваиваем им значения
 *
 *
 *         // Объединяем имя и фамилию через пробел
 *
 *
 *         // Выводим получившееся полное имя
 *
 *     }
 * }
 */

// JavaRush
package ru.javarush.java.core.level02.task06;

public class Solution {
    public static void main(String[] args) {
        // Объявляем переменные и присваиваем им значения
        String firstName = "Luke", lastName = "Skywalker";

        // Объединяем имя и фамилию через пробел
        String foo = firstName + " " + lastName;

        // Выводим получившееся полное имя
        System.out.println (foo);
    }
}

/*
 * // JavaRush
 * Правильное решение:
 * // Author: JavaRush's team
 * package ru.javarush.java.core.level02.task06;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Объявляем переменные и присваиваем им значения
 *         String firstName = "Luke";
 *         String lastName = "Skywalker";
 *
 *         // Объединяем имя и фамилию через пробел
 *         String fullName = firstName + " " + lastName;
 *
 *         // Выводим получившееся полное имя
 *         System.out.println(fullName);
 *     }
 * }
 */