## Authors: JavaRush's team, CodeGym's team, Altavista360
## Version: 1.0.0

### JavaRush
## Задача: Двумерный массив.
## Ссылка: https://javarush.com/tasks/ru.javarush.python.core.level15.task02

### CodeGym
## Task: Two-dimensional array.
## Link: https://codegym.cc/tasks/en.codegym.python.core.level15.task02

### JavaRush
## Условие:
# Создай квадратный массив 10х10 с использованием библиотеки array (имитируй двумерный массив с помощью индексации). Заполни его как таблицу умножения x*y. Выведи на экран. Примечание: х от 1 до 10 и y от 1 до 10. Класс list использовать нельзя.

### JavaRush
## Требования:
# • Программа должна создать двумерный массив размером 10x10 с использованием библиотеки array (имитировать двумерный массив с помощью индексации).
# • Программа должна заполнить массив таким образом, чтобы в ячейке с индексами [i][j] находилось произведение чисел i и j.
# • Программа должна вывести заполненный массив на экран в виде таблицы.
# • х от 1 до 10 и y от 1 до 10.
# • Программа не должна использовать класс list для создания и заполнения массива.

### JavaRush
## Черновик:
# # Двумерный массив.
#
# # Создание одномерного массива для имитации двумерного массива 10x10
# # Заполнение массива как таблицы умножения x * y
# # Примечание: х от 1 до 10 и y от 1 до 10.
# # Класс list использовать нельзя.
#
# # Напишите тут ваш код

### JavaRush
# Двумерный массив.

# Создание одномерного массива для имитации двумерного массива 10x10
# Заполнение массива как таблицы умножения x * y
# Примечание: х от 1 до 10 и y от 1 до 10.
# Класс list использовать нельзя.

# Напишите тут ваш код

import array

size = 10

matrix = array.array('i', (0,) * (size * size))

for x in range(1, size + 1):
    for y in range(1, size + 1):
        matrix[(x - 1) * size + (y - 1)] = x * y

for x in range(size):
    for y in range(size):
        print(matrix[x * size + y], end='\t')
    print()

### JavaRush
## Правильное решение:
## Author: JavaRush's team
# import array
#
# # Размерность массива
# size = 10
#
# # Создание одномерного массива для имитации двумерного массива 10x10
# matrix = array.array('i', (0,) * (size * size))
#
# # Заполнение массива как таблицы умножения x * y
# for x in range(1, size + 1):
#     for y in range(1, size + 1):
#         # Индексация через одномерный массив
#         matrix[(x - 1) * size + (y - 1)] = x * y
#
# # Вывод массива на экран в виде таблицы
# for x in range(size):
#     for y in range(size):
#         # Доступ к элементам массива с помощью индексации
#         print(matrix[x * size + y], end='\t')
#     print()