/*
 * Authors: JavaRush's team, CodeGym's team, Altavista360
 * Version: 1.0.0
 */

/*
 * // JavaRush
 * Задача: Покупка билета в кино 🎬
 * Ссылка: https://javarush.com/tasks/ru.javarush.java.core.level03.task01
 */

/*
 * // CodeGym
 * Task: Buying a Movie Ticket 🎬
 * Link: https://codegym.cc/tasks/en.codegym.java.core.level03.task01
 */

/*
 * // JavaRush
 * Условие:
 * Представьте, что вы пишете программу для кассы кинотеатра. Создайте переменную int visitorAge и присвойте ей значение 17. Используйте оператор if-else, чтобы вывести на экран "Доступ запрещен", если возраст посетителя меньше 18. В противном случае выведите "Добро пожаловать!".
 */

/*
 * // JavaRush
 * Требования:
 * • В программе должна быть объявлена переменная типа int с именем visitorAge.
 * • Переменной visitorAge должно быть присвоено значение 17.
 * • Для проверки возраста должен использоваться оператор if-else.
 * • В условии должно сравниваться, меньше ли значение visitorAge 18.
 * • Если visitorAge меньше 18, программа должна вывести на экран "Доступ запрещен".
 * • Если visitorAge не меньше 18, программа должна вывести на экран "Добро пожаловать!".
 */

/*
 * // JavaRush
 * Черновик:
 * package ru.javarush.java.core.level03.task01;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Объявляем переменную visitorAge и сразу инициализируем её значением 17
 *
 *
 *         // Используем оператор if-else для проверки: если возраст меньше 18
 *         if (/* условие */) {
 *             // При несовершеннолетии выводим сообщение о запрете доступа
 *
 *         } else {
 *             // Иначе — приветствуем посетителя
 *
 *         }
 *     }
 * }
 */

// JavaRush
package ru.javarush.java.core.level03.task01;

public class Solution {
    public static void main(String[] args) {
        // Объявляем переменную visitorAge и сразу инициализируем её значением 17
        int visitorAge = 17;

        // Используем оператор if-else для проверки: если возраст меньше 18
        if (visitorAge < 18) {
            // При несовершеннолетии выводим сообщение о запрете доступа
        System.out.println("Доступ запрещен");
        } else {
            // Иначе — приветствуем посетителя
        System.out.println("Добро пожаловать!");
        }
    }
}

/*
 * // JavaRush
 * Правильное решение:
 * // Author: JavaRush's team
 * package ru.javarush.java.core.level03.task01;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Объявляем переменную visitorAge и сразу инициализируем её значением 17
 *         int visitorAge = 17;
 *
 *         // Используем оператор if-else для проверки: если возраст меньше 18
 *         if (visitorAge < 18) {
 *             // При несовершеннолетии выводим сообщение о запрете доступа
 *             System.out.println("Доступ запрещен");
 *         } else {
 *             // Иначе — приветствуем посетителя
 *             System.out.println("Добро пожаловать!");
 *         }
 *     }
 * }
 */