/*
 * Authors: JavaRush's team, CodeGym's team, Altavista360
 * Version: 1.0.0
 */

/*
 * // JavaRush
 * Задача: Регистрация нового аккаунта 🔒
 * Ссылка: https://javarush.com/tasks/ru.javarush.java.core.level04.task12
 */

/*
 * // CodeGym
 * Task: New account registration 🔒
 * Link: https://codegym.cc/tasks/en.codegym.java.core.level04.task12
 */

/*
 * // JavaRush
 * Условие:
 * Вы создаёте форму регистрации, где пароль должен быть не короче 6 символов.
 * Запросите у пользователя ввод пароля с помощью Scanner.
 * Используйте цикл do-while, чтобы программа повторно запрашивала пароль, пока введённая строка короче 6 символов.
 * После ввода корректного пароля программа должна вывести "Пароль надёжен, аккаунт создан!".
 */

/*
 * // JavaRush
 * Требования:
 * • Программа должна использовать класс Scanner для считывания пароля пользователя с клавиатуры.
 * • Для многократного запроса пароля должен использоваться цикл do-while.
 * • Введённый пароль должен проверяться на длину — если он короче 6 символов, запрос должен повторяться.
 * • После ввода корректного пароля (длина не менее 6 символов) программа должна вывести "Пароль надёжен, аккаунт создан!".
 */

/*
 * // JavaRush
 * Черновик:
 * package ru.javarush.java.core.level04.task12;
 *
 * import java.util.Scanner;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Создаем Scanner для чтения пароля с клавиатуры
 *
 *
 *         // переменная для введенного пароля
 *
 *
 *         // Цикл do-while гарантирует минимум один запрос пароля
 *         do {
 *             // Запрашиваем ввод пароля
 *
 *             // читаем строку целиком
 *
 *         } while (/* условие */); // повторяем, пока пароль короче 6 символов
 *
 *         // Сообщение об успешной регистрации
 *
 *     }
 * }
 */

// JavaRush
package ru.javarush.java.core.level04.task12;

import java.util.Scanner;

public class Solution {
    public static void main(String[] args) {
        // Создаем Scanner для чтения пароля с клавиатуры
        Scanner inputString = new Scanner(System.in);

        // переменная для введенного пароля
        String inputPassword;

        // Цикл do-while гарантирует минимум один запрос пароля
        do {
            // Запрашиваем ввод пароля
            System.out.println("Введите надёжный пароль ( > 6 знаков): ");
            // читаем строку целиком
            inputPassword = inputString.nextLine();
        } while (inputPassword.length() < 6/* условие */); // повторяем, пока пароль короче 6 символов

        // Сообщение об успешной регистрации
        System.out.println("Пароль надёжен, аккаунт создан!");
    }
}

/*
 * // JavaRush
 * Правильное решение:
 * // Author: JavaRush's team
 * package ru.javarush.java.core.level04.task12;
 *
 * import java.util.Scanner;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Создаем Scanner для чтения пароля с клавиатуры
 *         Scanner console = new Scanner(System.in);
 *
 *         String password; // переменная для введенного пароля
 *
 *         // Цикл do-while гарантирует минимум один запрос пароля
 *         do {
 *             System.out.println("Введите пароль:");
 *             password = console.nextLine(); // читаем строку целиком
 *         } while (password.length() < 6); // повторяем, пока пароль короче 6 символов
 *
 *         // Сообщение об успешной регистрации
 *         System.out.println("Пароль надёжен, аккаунт создан!");
 *     }
 * }
 */