/*
 * Authors: JavaRush's team, CodeGym's team, Altavista360
 * Version: 1.0.0
 */

/*
 * // JavaRush
 * Задача: Выбор победителя в соревновании 🏆
 * Ссылка: https://javarush.com/tasks/ru.javarush.java.core.level03.task17
 */

/*
 * // CodeGym
 * Task: Competition Winner Selection 🏆
 * Link: https://codegym.cc/tasks/en.codegym.java.core.level03.task17
 */

/*
 * // JavaRush
 * Условие:
 * Представьте, что два спортсмена, Алекс и Майк, соревнуются в скорости.
 * Объявите две переменные типа int: alexsTime и mikesTime. Присвойте им любое время в секундах.
 * Используя тернарный оператор, определите, кто из них быстрее. Сохраните наименьшее время в переменную fastestTime и выведите её на экран.
 */

/*
 * // JavaRush
 * Требования:
 * • В программе должны быть объявлены две переменные типа int с именами alexsTime и mikesTime.
 * • Переменным alexsTime и mikesTime должны быть присвоены значения времени (в секундах).
 * • Для определения минимального значения между alexsTime и mikesTime должен использоваться тернарный оператор (?:).
 * • Результат работы тернарного оператора (наименьшее время) должен быть сохранён в переменную int с именем fastestTime.
 * • Значение переменной fastestTime должно быть выведено на экран.
 */

/*
 * // JavaRush
 * Черновик:
 * package ru.javarush.java.core.level03.task17;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Объявляем две переменные для времени спортсменов
 *
 *
 *         // Используем тернарный оператор для определения минимального времени
 *
 *
 *         // Выводим на экран наименьшее время
 *
 *     }
 * }
 */

// JavaRush
package ru.javarush.java.core.level03.task17;

public class Solution {
    public static void main(String[] args) {
        // Объявляем две переменные для времени спортсменов
        int alexsTime = 69;
        int mikesTime = 88;

        // Используем тернарный оператор для определения минимального времени
        int fastestTime = alexsTime < mikesTime  ? alexsTime : mikesTime;

        // Выводим на экран наименьшее время
        System.out.println(fastestTime);
    }
}

/*
 * // JavaRush
 * Правильное решение:
 * // Author: JavaRush's team
 * package ru.javarush.java.core.level03.task17;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Объявляем две переменные для времени спортсменов
 *         int alexsTime = 120; // Время Алекса в секундах
 *         int mikesTime = 115; // Время Майка в секундах
 *
 *         // Используем тернарный оператор для определения минимального времени
 *         int fastestTime = alexsTime < mikesTime ? alexsTime : mikesTime;
 *
 *         // Выводим на экран наименьшее время
 *         System.out.println(fastestTime);
 *     }
 * }
 */