## Authors: JavaRush's team, CodeGym's team, Altavista360
## Version: 1.0.0

### JavaRush
## Задача: Суммаист
## Ссылка: https://javarush.com/tasks/ru.javarush.python.core.level03.task06

### CodeGym
## Task: Sumist
## Link: https://codegym.cc/tasks/en.codegym.python.core.level03.task06

### JavaRush
## Условие:
# Напишите программу, которая запрашивает у пользователя два числа, сохраняет их в переменные и выводит их сумму. Пример: Введите первое число: 5 Введите второе число: 7 Сумма: 12

### JavaRush
## Требования:
# • Программа должна включать переменную для первого числа, в которую сохраняется введенное пользователем значение.
# • Программа должна включать переменную для второго числа, в которую сохраняется введенное пользователем значение.
# • Программа должна запрашивать у пользователя первое число с помощью функции ввода.
# • Программа должна запрашивать у пользователя второе число с помощью функции ввода.
# • Программа должна вычислять сумму значений двух введенных пользователем чисел.
# • Программа должна выводить результат сложения двух введенных чисел на экран.

### JavaRush
## Черновик:
# # Суммаист
# 
# # Напишите программу, которая запрашивает у пользователя два числа, сохраняет их в переменные и выводит их сумму.
# # Пример:
# # Введите первое число: 5
# # Введите второе число: 7
# # Сумма: 12
# 
# # Напишите тут ваш код

### JavaRush
# Суммаист

# Напишите программу, которая запрашивает у пользователя два числа, сохраняет их в переменные и выводит их сумму.
# Пример:
# Введите первое число: 5
# Введите второе число: 7
# Сумма: 12

# Напишите тут ваш код

foo = float(input("Введите 1-ое число: "))
bar = float(input("Введите 2-ое число: "))
baz = foo + bar
print("Сумма:", baz)

### JavaRush
## Правильное решение:
## Author: JavaRush's team
# first = float(input("Введите первое число: "))
# second = float(input("Введите второе число: "))
# summa = first + second
# print("Сумма:", summa)