## Authors: JavaRush's team, CodeGym's team, Altavista360
## Version: 1.0.0

### JavaRush
## Задача: Рост дюймах
## Ссылка: https://javarush.com/tasks/ru.javarush.python.core.level02.task03

### CodeGym
## Task: Height in inches
## Link: https://codegym.cc/tasks/en.codegym.python.core.level02.task03

### JavaRush
## Условие:
# Создайте переменную centimeter и присвойте ей ваш рост в сантиметрах. Создайте переменную inches и присвойте ей ваш рост в дюймах (1 дюйм == 2.54 см). Выведите ваш рост в дюймах на экран

### JavaRush
## Требования:
# • Программа должна включать переменную centimeter, которой присваивается целочисленное или вещественное значение, представляющее рост в сантиметрах.
# • Программа должна включать переменную inches, в которую сохраняется рост в дюймах. Рост в дюймах должен быть вычислен на основе значения в сантиметрах, где 1 дюйм равен 2.54 сантиметра.
# • Программа должна использовать функцию print() для вывода значения переменной inches на экран.

### JavaRush
## Черновик:
# # Рост дюймах
# 
# # Создайте переменную centimeter и присвойте ей ваш рост в сантиметрах.
# # Создайте переменную inches и присвойте ей ваш рост в дюймах (1 дюйм == 2.54 см).
# # Выведите ваш рост в дюймах на экран
# 
# # Напишите тут ваш код

### JavaRush
# Рост дюймах

# Создайте переменную centimeter и присвойте ей ваш рост в сантиметрах.
# Создайте переменную inches и присвойте ей ваш рост в дюймах (1 дюйм == 2.54 см).
# Выведите ваш рост в дюймах на экран

# Напишите тут ваш код

centimeter = 200

inches = centimeter / 2.54

print(inches, "дюймов")

### JavaRush
## Правильное решение:
## Author: JavaRush's team
# # Создаем переменную centimeter и присваиваем ей значение роста в сантиметрах
# centimeter = 180  # Замените 180 на ваш реальный рост в сантиметрах
# 
# # Вычисляем рост в дюймах
# inches = centimeter / 2.54
# 
# # Выводим рост в дюймах на экран
# print("Ваш рост в дюймах:", inches)