/*
 * Authors: JavaRush's team, CodeGym's team, Altavista360
 * Version: 1.0.0
 */

/*
 * // JavaRush
 * Задача: Год выпуска фильма 🎞️
 * Ссылка: https://javarush.com/tasks/ru.javarush.java.core.level02.task11
 */

/*
 * // CodeGym
 * Task: Film release year 🎞️
 * Link: https://codegym.cc/tasks/en.codegym.java.core.level02.task11
 */

/*
 * // JavaRush
 * Условие:
 * Вы хотите получить год выпуска фильма из названия файла.
 * Создайте переменную типа String, содержащую только цифры, например, "1999".
 * Преобразуйте эту строку в число, чтобы можно было выполнять математические операции, и выведите его на экран.
 */

/*
 * // JavaRush
 * Требования:
 * • В программе должна быть объявлена переменная типа String, содержащая строку, состоящую только из цифр (например, "1999").
 * • Строковая переменная должна быть преобразована в числовой тип данных (например, int или Integer) с помощью соответствующего метода.
 * • Результат преобразования должен быть числовым значением, чтобы с ним можно было выполнять математические операции.
 * • Полученное числовое значение года должно быть выведено на экран.
 */

/*
 * // JavaRush
 * Черновик:
 * package ru.javarush.java.core.level02.task11;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Объявляем строковую переменную, содержащую год выпуска фильма
 *
 *
 *         // Преобразуем строку в числовой тип int
 *
 *
 *         // Выводим числовое значение года на экран
 *
 *     }
 * }
 */

// JavaRush
package ru.javarush.java.core.level02.task11;

public class Solution {
    public static void main(String[] args) {
        // Объявляем строковую переменную, содержащую год выпуска фильма
        String foo = "1999";

        // Преобразуем строку в числовой тип int
        int bar = Integer.parseInt(foo);

        // Выводим числовое значение года на экран
        System.out.println (bar);
    }
}

/*
 * // JavaRush
 * Правильное решение:
 * // Author: JavaRush's team
 * package ru.javarush.java.core.level02.task11;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Объявляем строковую переменную, содержащую год выпуска фильма
 *         String yearString = "1999";
 *
 *         // Преобразуем строку в числовой тип int
 *         int year = Integer.parseInt(yearString);
 *
 *         // Выводим числовое значение года на экран
 *         System.out.println(year);
 *     }
 * }
 */