/*
 * Authors: JavaRush's team, CodeGym's team, Altavista360
 * Version: 1.0.0
 */

/*
 * // JavaRush
 * Задача: Номера мест в вагоне 🚂
 * Ссылка: https://javarush.com/tasks/ru.javarush.java.core.level04.task06
 */

/*
 * // CodeGym
 * Task: Seat numbers in the train car 🚂
 * Link: https://codegym.cc/tasks/en.codegym.java.core.level04.task06
 */

/*
 * // JavaRush
 * Условие:
 * Вам нужно вывести номера всех чётных мест в вагоне поезда, с 0-го по 10-е включительно.
 * Создайте цикл for, который выведет на экран эти номера. Каждое число должно быть на новой строке.
 */

/*
 * // JavaRush
 * Требования:
 * • Для вывода номеров мест должен использоваться цикл for.
 * • Цикл должен перебирать номера мест от 0 до 10 включительно.
 * • На экран должны выводиться только чётные номера мест из указанного диапазона.
 * • Каждое чётное число должно выводиться на новой строке.
 */

/*
 * // JavaRush
 * Черновик:
 * package ru.javarush.java.core.level04.task06;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Используем цикл for для перебора чисел от 0 до 10 включительно
 *         for (/* инициализация */; /* условие */; /* изменение */) {
 *             // Проверяем, является ли текущее число чётным
 *             if (/* условие */) {
 *                 // Если число чётное, выводим его на экран
 *
 *             }
 *         }
 *     }
 * }
 */

// JavaRush
package ru.javarush.java.core.level04.task06;

public class Solution {
    public static void main(String[] args) {
        // Используем цикл for для перебора чисел от 0 до 10 включительно
        for (int i = 0; i <= 10; i++) {
            // Проверяем, является ли текущее число чётным
            if (i % 2 == 0) {
                // Если число чётное, выводим его на экран
                System.out.println(i);
            }
        }
    }
}

/*
 * // JavaRush
 * Правильное решение:
 * // Author: JavaRush's team
 * package ru.javarush.java.core.level04.task06;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Используем цикл for для перебора чисел от 0 до 10 включительно
 *         for (int i = 0; i <= 10; i++) {
 *             // Проверяем, является ли текущее число чётным
 *             if (i % 2 == 0) {
 *                 // Если число чётное, выводим его на экран
 *                 System.out.println(i);
 *             }
 *         }
 *     }
 * }
 */