/*
 * Authors: JavaRush's team, CodeGym's team, Altavista360
 * Version: 1.0.0
 */

/*
 * // JavaRush
 * Задача: Создание визитной карточки 📇
 * Ссылка: https://javarush.com/tasks/ru.javarush.java.core.level02.task20
 */

/*
 * // CodeGym
 * Task: Creating a business card 📇
 * Link: https://codegym.cc/tasks/en.codegym.java.core.level02.task20
 */

/*
 * // JavaRush
 * Условие:
 * Вы создаете цифровую визитную карточку. Напишите программу, которая считывает с клавиатуры ваше имя (строку) и возраст (целое число).
 * Затем программа должна вывести на экран строку "Меня зовут [имя], мне [возраст] лет.", где имя и возраст заменены на введенные вами значения.
 */

/*
 * // JavaRush
 * Требования:
 * • Программа должна использовать класс Scanner для чтения данных с клавиатуры.
 * • Программа должна считать с клавиатуры строку, содержащую имя пользователя.
 * • Программа должна считать с клавиатуры целое число, обозначающее возраст пользователя.
 * • Программа должна вывести строку в формате "Меня зовут [имя], мне [возраст] лет.", подставив введённые значения вместо [имя] и [возраст].
 */

/*
 * // JavaRush
 * Черновик:
 * package ru.javarush.java.core.level02.task20;
 *
 * import java.util.Scanner;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Создаем объект Scanner для чтения данных с консоли
 *
 *
 *         // Считываем имя пользователя (строка)
 *
 *
 *         // Считываем возраст пользователя (целое число)
 *
 *
 *         // Выводим отформатированную визитную карточку
 *
 *     }
 * }
 */

// JavaRush
package ru.javarush.java.core.level02.task20;

import java.util.Scanner;

public class Solution {
    public static void main(String[] args) {
        // Создаем объект Scanner для чтения данных с консоли
        Scanner keyboard = new Scanner(System.in);

        // Считываем имя пользователя (строка)
        String name = keyboard.nextLine();

        // Считываем возраст пользователя (целое число)
        int age = keyboard.nextInt();

        // Выводим отформатированную визитную карточку
        System.out.println("Меня зовут " + name + ", мне " + age + " лет.");
    }
}

/*
 * // JavaRush
 * Правильное решение:
 * // Author: JavaRush's team
 * package ru.javarush.java.core.level02.task20;
 *
 * import java.util.Scanner;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Создаем объект Scanner для чтения данных с консоли
 *         Scanner console = new Scanner(System.in);
 *
 *         // Считываем имя пользователя (строка)
 *         String name = console.nextLine();
 *
 *         // Считываем возраст пользователя (целое число)
 *         int age = console.nextInt();
 *
 *         // Выводим отформатированную визитную карточку
 *         System.out.println("Меня зовут " + name + ", мне " + age + " лет.");
 *     }
 * }
 */