/*
 * Authors: JavaRush's team, CodeGym's team, Altavista360
 * Version: 1.0.0
 */

/*
 * // JavaRush
 * Задача: Учет трат на кофе ☕
 * Ссылка: https://javarush.com/tasks/ru.javarush.java.core.level04.task04
 */

/*
 * // CodeGym
 * Task: Tracking coffee expenses ☕
 * Link: https://codegym.cc/tasks/en.codegym.java.core.level04.task04
 */

/*
 * // JavaRush
 * Условие:
 * Представьте, что вы записываете, сколько тратите на кофе каждый день. Напишите программу, которая запрашивает стоимость каждой чашки. Ввод должен продолжаться до тех пор, пока вы не введете отрицательное число (например, -1 как сигнал к остановке).
 * Затем программа должна вывести общую сумму, потраченную на кофе. Отрицательное число в подсчет не включается.
 */

/*
 * // JavaRush
 * Требования:
 * • Программа должна использовать цикл while для многократного запроса стоимости кофе у пользователя.
 * • Ввод должен завершаться, когда пользователь вводит отрицательное число (например, -1).
 * • Отрицательное число, введенное для завершения, не должно учитываться в общей сумме.
 * • Программа должна корректно суммировать все введённые неотрицательные значения стоимости кофе.
 * • После завершения ввода программа должна вывести на экран общую сумму, потраченную на кофе.
 */

/*
 * // JavaRush
 * Черновик:
 * package ru.javarush.java.core.level04.task04;
 *
 * import java.util.Scanner;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Создаем Scanner для чтения данных с консоли
 *
 *
 *         // Сумма всех введенных стоимостей
 *
 *
 *         // Запрашиваем первую стоимость чашки кофе
 *
 *
 *         // Используем цикл while для продолжения ввода до тех пор, пока не будет введено отрицательное число
 *         while (/* условие */) {
 *             // Добавляем введенную стоимость к общей сумме
 *
 *             // Запрашиваем следующую стоимость
 *
 *         }
 *
 *         // Выводим итоговую сумму расходов на кофе (отрицательное значение в сумму не входит)
 *
 *     }
 * }
 */

// JavaRush
package ru.javarush.java.core.level04.task04;

import java.util.Scanner;

public class Solution {
    public static void main(String[] args) {
        // Создаем Scanner для чтения данных с консоли
        Scanner consoleInput = new Scanner(System.in);

        // Сумма всех введенных стоимостей
        int totalAmount = 0;

        // Запрашиваем первую стоимость чашки кофе
        int priceCupCoffee = consoleInput.nextInt();

        // Используем цикл while для продолжения ввода до тех пор, пока не будет введено отрицательное число
        while (priceCupCoffee >= 0) {
            // Добавляем введенную стоимость к общей сумме
            totalAmount = totalAmount + priceCupCoffee;
            // Запрашиваем следующую стоимость
            priceCupCoffee = consoleInput.nextInt();
        }

        // Выводим итоговую сумму расходов на кофе (отрицательное значение в сумму не входит)
        System.out.println(totalAmount);
    }
}

/*
 * // JavaRush
 * Правильное решение:
 * // Author: JavaRush's team
 * package ru.javarush.java.core.level04.task04;
 *
 * import java.util.Scanner;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Создаем Scanner для чтения данных с консоли
 *         Scanner console = new Scanner(System.in);
 *         // Сумма всех введенных стоимостей
 *         double sum = 0;
 *         // Запрашиваем первую стоимость чашки кофе
 *         System.out.println("Введите стоимость чашки кофе (отрицательное число для завершения):");
 *         double cost = console.nextDouble();
 *         // Используем цикл while для продолжения ввода до тех пор, пока не будет введено отрицательное число
 *         while (cost >= 0) {
 *             // Добавляем введенную стоимость к общей сумме
 *             sum += cost;
 *             // Запрашиваем следующую стоимость
 *             System.out.println("Введите стоимость чашки кофе (отрицательное число для завершения):");
 *             cost = console.nextDouble();
 *         }
 *         // Выводим итоговую сумму расходов на кофе (отрицательное значение в сумму не входит)
 *         System.out.println(sum);
 *     }
 * }
 */