## Authors: JavaRush's team, CodeGym's team, Altavista360
## Version: 1.0.0

### JavaRush
## Задача: Все не так однозначно.
## Ссылка: https://javarush.com/tasks/ru.javarush.python.core.level04.task04

### CodeGym
## Task: Not everything is so simple.
## Link: https://codegym.cc/tasks/en.codegym.python.core.level04.task04

### JavaRush
## Условие:
# Напиши программу, которая делит целое число на целое. Выведи на экран тип результата.

### JavaRush
## Требования:
# • Программа должна выполнить операцию деления целого числа на целое.
# • Программа должна определить тип результата операции деления.
# • Программа должна вывести тип результата на экран.

### JavaRush
## Черновик:
# # Все не так однозначно.
#
# # Напиши программу, которая делит целое число на целое.
# # Выведи на экран тип результата.
#
# # Напишите тут ваш код

### JavaRush
# Все не так однозначно.

# Напиши программу, которая делит целое число на целое.
# Выведи на экран тип результата.

# Напишите тут ваш код

foo = int(input("Введите 1-ое число: "))
bar = int(input("Введите 2-ое число: "))
baz = foo / bar
print(type(baz))

### JavaRush
## Правильное решение:
## Author: JavaRush's team
# # Вводим два целых числа
# a = int(input("Введите первое целое число: "))
# b = int(input("Введите второе целое число: "))
#
# # Делим первое число на второе
# result = a / b
#
# # Выводим тип результата
# print(type(result))