/*
 * Authors: JavaRush's team, CodeGym's team, Altavista360
 * Version: 1.0.0
 */

/*
 * // JavaRush
 * Задача: Приветствие пользователя в приложении 🌤️
 * Ссылка: https://javarush.com/tasks/ru.javarush.java.core.level03.task19
 */

/*
 * // CodeGym
 * Task: Greeting the user in the app 🌤️
 * Link: https://codegym.cc/tasks/en.codegym.java.core.level03.task19
 */

/*
 * // JavaRush
 * Условие:
 * Ваше приложение должно приветствовать пользователя по-разному в зависимости от времени суток.
 * Объявите переменную int currentHour, которая хранит текущий час (от 0 до 23).
 * С помощью тернарного оператора присвойте строковой переменной greetingMessage значение "Доброе утро", если currentHour меньше 12, иначе "Добрый день".
 * Выведите greetingMessage на экран.
 */

/*
 * // JavaRush
 * Требования:
 * • В программе должна быть объявлена переменная int с именем currentHour, хранящая значение текущего часа (от 0 до 23).
 * • Строковой переменной greetingMessage должно присваиваться значение с помощью тернарного оператора.
 * • Если значение currentHour меньше 12, greetingMessage должно быть равно "Доброе утро", иначе "Добрый день".
 * • Программа должна вывести значение переменной greetingMessage на экран.
 */

/*
 * // JavaRush
 * Черновик:
 * package ru.javarush.java.core.level03.task19;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Объявляем переменную currentHour, которая хранит текущий час (от 0 до 23)
 *
 *
 *         // Используем тернарный оператор для выбора приветствия
 *
 *
 *         // Выводим приветственное сообщение на экран
 *
 *     }
 * }
 */

// JavaRush
package ru.javarush.java.core.level03.task19;

public class Solution {
    public static void main(String[] args) {
        // Объявляем переменную currentHour, которая хранит текущий час (от 0 до 23)
        int currentHour = 14;

        // Используем тернарный оператор для выбора приветствия
        String greetingMessage = currentHour < 12  ? "Доброе утро" : "Добрый день";

        // Выводим приветственное сообщение на экран
        System.out.println(greetingMessage);
    }
}

/*
 * // JavaRush
 * Правильное решение:
 * // Author: JavaRush's team
 * package ru.javarush.java.core.level03.task19;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Объявляем переменную currentHour, которая хранит текущий час (от 0 до 23)
 *         int currentHour = 10; // Пример значения, можно заменить на любое от 0 до 23
 *
 *         // Используем тернарный оператор для выбора приветствия
 *         String greetingMessage = currentHour < 12 ? "Доброе утро" : "Добрый день";
 *
 *         // Выводим приветственное сообщение на экран
 *         System.out.println(greetingMessage);
 *     }
 * }
 */