/*
 * Authors: JavaRush's team, CodeGym's team, Altavista360
 * Version: 1.0.0
 */

/*
 * // JavaRush
 * Задача: Копирование и изменение данных проекта 📝
 * Ссылка: https://javarush.com/tasks/ru.javarush.java.core.level02.task14
 */

/*
 * // CodeGym
 * Task: Copying and modifying project data 📝
 * Link: https://codegym.cc/tasks/en.codegym.java.core.level02.task14
 */

/*
 * // JavaRush
 * Условие:
 * Вы создаете копию названия проекта, чтобы внести в неё изменения.
 * Создайте переменную String projectName и присвойте ей значение "Java".
 * Затем создайте другую переменную String newProjectName и присвойте ей значение projectName.
 * После этого измените newProjectName на "Java Programming".
 * Выведите значения обеих переменных на экран.
 */

/*
 * // JavaRush
 * Требования:
 * •  В программе должна быть объявлена переменная типа String с именем projectName.
 * • Переменной projectName должно быть присвоено значение "Java".
 * • В программе должна быть объявлена переменная типа String с именем newProjectName, которой сразу присваивается значение переменной projectName.
 * • Значение переменной newProjectName должно быть изменено на "Java Programming" после присваивания projectName.
 * • Программа должна вывести на экран значения обеих переменных: сначала projectName, затем newProjectName (или наоборот, но оба значения должны быть видны).
 */

/*
 * // JavaRush
 * Черновик:
 * package ru.javarush.java.core.level02.task14;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Объявляем переменную projectName и задаем ей исходное название проекта
 *
 *
 *         // Объявляем переменную newProjectName и инициализируем ее значением из projectName
 *
 *
 *         // Изменяем значение копии названия проекта
 *
 *
 *         // Выводим на экран оригинальное и измененное название проекта
 *
 *
 *     }
 * }
 */

// JavaRush
package ru.javarush.java.core.level02.task14;

public class Solution {
    public static void main(String[] args) {
        // Объявляем переменную projectName и задаем ей исходное название проекта
        String projectName = "Java";

        // Объявляем переменную newProjectName и инициализируем ее значением из projectName
        String newProjectName = projectName;

        // Изменяем значение копии названия проекта
        newProjectName = newProjectName + " Programming";

        // Выводим на экран оригинальное и измененное название проекта
        System.out.println(projectName);
        System.out.println(newProjectName);
    }
}

/*
 * // JavaRush
 * Правильное решение:
 * // Author: JavaRush's team
 * package ru.javarush.java.core.level02.task14;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Объявляем переменную projectName и задаем ей исходное название проекта
 *         String projectName = "Java";
 *
 *         // Объявляем переменную newProjectName и инициализируем ее значением из projectName
 *         String newProjectName = projectName;
 *
 *         // Изменяем значение копии названия проекта
 *         newProjectName = "Java Programming";
 *
 *         // Выводим на экран оригинальное и измененное название проекта
 *         System.out.println(projectName);
 *         System.out.println(newProjectName);
 *     }
 * }
 */