## Authors: JavaRush's team, CodeGym's team, Altavista360
## Version: 1.0.0

### JavaRush
## Задача: Создаем двумерный массив.
## Ссылка: https://javarush.com/tasks/ru.javarush.python.core.level15.task12

### CodeGym
## Task: Create a two-dimensional array.
## Link: https://codegym.cc/tasks/en.codegym.python.core.level15.task12

### JavaRush
## Условие:
# Создай квадратный массив 10х10 с использованием библиотеки numpy. Заполни его как таблицу умножения x*y. Выведи на экран. Класс list использовать нельзя.

### JavaRush
## Требования:
# • Программа должна импортировать библиотеку numpy, чтобы использовать её функции и методы для создания и манипуляции массивами.
# • Программа должна создать квадратный массив размером 10x10 с использованием библиотеки numpy.
# • Программа должна заполнить массив таким образом, чтобы элемент массива [i, j] был результатом умножения i и j.
# • Программа должна вывести заполненный массив на экран.
# • Программа не должна использовать класс list для создания или заполнения массива.

### JavaRush
## Черновик:
# # Создаем двумерный массив.
#
# # Создай квадратный массив 10х10 с использованием библиотеки numpy.
# # Заполни его как таблицу умножения x*y. Выведи на экран.
# # Класс list использовать нельзя.
#
# # Напишите тут ваш код

### JavaRush
# Создаем двумерный массив.

# Создай квадратный массив 10х10 с использованием библиотеки numpy.
# Заполни его как таблицу умножения x*y. Выведи на экран.
# Класс list использовать нельзя.

# Напишите тут ваш код

import numpy as np

array = np.fromfunction(lambda i, j: (i + 1) * (j + 1), (10, 10), dtype=int)
print(array)

### JavaRush
## Правильное решение:
## Author: JavaRush's team
# import numpy as np
#
# # Создаем массив 10x10
# array = np.fromfunction(lambda i, j: (i + 1) * (j + 1), (10, 10), dtype=int)
#
# # Выводим массив на экран
# print(array)