/*
 * Authors: JavaRush's team, CodeGym's team, Altavista360
 * Version: 1.0.0
 */

/*
 * // JavaRush
 * Задача: Цитата героя 🗣️
 * Ссылка: https://javarush.com/tasks/ru.javarush.java.core.level02.task07
 */

/*
 * // CodeGym
 * Task: Hero's Quote 🗣️
 * Link: https://codegym.cc/tasks/en.codegym.java.core.level02.task07
 */

/*
 * // JavaRush
 * Условие:
 * Вы хотите вывести цитату героя, который сказал: "Поехали!".
 * Создайте переменную типа String с именем heroQuote. Присвойте ей это значение, используя экранирование кавычек, и выведите heroQuote на экран.
 */

/*
 * // JavaRush
 * Требования:
 * • В программе должна быть объявлена переменная типа String с именем heroQuote.
 * • Переменной heroQuote должно быть присвоено значение "Поехали!", при этом двойные кавычки внутри строки должны быть экранированы.
 * • На экран должно быть выведено значение переменной heroQuote с помощью System.out.println.
 */

/*
 * // JavaRush
 * Черновик:
 * package ru.javarush.java.core.level02.task07;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Внутренние двойные кавычки экранируем обратным слэшем
 *
 *
 *         // Выводим значение переменной на экран
 *
 *     }
 * }
 */

// JavaRush
package ru.javarush.java.core.level02.task07;

public class Solution {
    public static void main(String[] args) {
        // Внутренние двойные кавычки экранируем обратным слэшем
        String heroQuote = "\"Поехали!\"";

        // Выводим значение переменной на экран
        System.out.println(heroQuote);
    }
}

/*
 * // JavaRush
 * Правильное решение:
 * // Author: JavaRush's team
 * package ru.javarush.java.core.level02.task07;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Внутренние двойные кавычки экранируем обратным слэшем
 *         String heroQuote = "\"Поехали!\"";
 *
 *         // Выводим значение переменной на экран
 *         System.out.println(heroQuote);
 *     }
 * }
 */