/*
 * Authors: JavaRush's team, CodeGym's team, Altavista360
 * Version: 1.0.0
 */

/*
 * // JavaRush
 * Задача: Поиск правды 🧐
 * Ссылка: https://javarush.com/tasks/ru.javarush.java.core.level03.task09
 */

/*
 * // CodeGym
 * Task: Finding the Truth 🧐
 * Link: https://codegym.cc/tasks/en.codegym.java.core.level03.task09
 */

/*
 * // JavaRush
 * Условие:
 * Вы пишете программу, чтобы проверить правдивость утверждения. Создайте переменную типа boolean с именем isJavaFun и присвойте ей значение true. Выведите это значение на экран.
 */

/*
 * // JavaRush
 * Требования:
 * • В программе должна быть объявлена переменная типа boolean с именем isJavaFun.
 * • Переменной isJavaFun должно быть присвоено значение true.
 * • Программа должна вывести на экран значение переменной isJavaFun.
 * • В коде не должно быть попыток использовать другие типы данных для переменной isJavaFun.
 */

/*
 * // JavaRush
 * Черновик:
 * package ru.javarush.java.core.level03.task09;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Объявляем переменную типа boolean с именем isJavaFun
 *
 *
 *         // Выводим значение переменной isJavaFun на экран
 *
 *     }
 * }
 */

// JavaRush
package ru.javarush.java.core.level03.task09;

public class Solution {
    public static void main(String[] args) {
        // Объявляем переменную типа boolean с именем isJavaFun
        boolean isJavaFun = true;

        // Выводим значение переменной isJavaFun на экран
        System.out.println(isJavaFun);
    }
}

/*
 * // JavaRush
 * Правильное решение:
 * // Author: JavaRush's team
 * package ru.javarush.java.core.level03.task09;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Объявляем переменную типа boolean с именем isJavaFun
 *         boolean isJavaFun = true;
 *
 *         // Выводим значение переменной isJavaFun на экран
 *         System.out.println(isJavaFun);
 *     }
 * }
 */