/*
 * Authors: JavaRush's team, CodeGym's team, Altavista360
 * Version: 1.0.0
 */

/*
 * // JavaRush
 * Задача: Проверка входа на вечеринку 🥳
 * Ссылка: https://javarush.com/tasks/ru.javarush.java.core.level03.task05
 */

/*
 * // CodeGym
 * Task: Party Entry Check 🥳
 * Link: https://codegym.cc/tasks/en.codegym.java.core.level03.task05
 */

/*
 * // JavaRush
 * Условие:
 * Вы пишете программу-фейсконтроль для входа на вечеринку. Попросите пользователя ввести его возраст и секретный код.
 * Если возраст больше или равен 18, И при этом код — "OPEN", выведите "Вход разрешен!". В противном случае выведите "Вам сегодня не повезло, вход запрещен.".
 */

/*
 * // JavaRush
 * Требования:
 * • Программа должна запросить у пользователя ввод его возраста.
 * • Программа должна запросить у пользователя ввод секретного кода.
 * • Программа должна проверить, что введённый возраст больше или равен 18.
 * • Программа должна проверить, что введённый секретный код точно равен строке "OPEN".
 * • Проверка возраста и кода должна быть реализована с помощью вложенных if-операторов.
 * • Если обе проверки пройдены, программа должна вывести "Вход разрешен!".
 * • Если хотя бы одна из проверок не пройдена, программа должна вывести "Вам сегодня не повезло, вход запрещен."
 */

/*
 * // JavaRush
 * Черновик:
 * package ru.javarush.java.core.level03.task05;
 *
 * import java.util.Scanner;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Создаем объект Scanner для ввода данных с клавиатуры
 *         Scanner console = new Scanner(System.in);
 *
 *         // Запрашиваем у пользователя ввод возраста
 *         System.out.println("Введите ваш возраст:");
 *         int age = console.nextInt(); // Читаем возраст как целое число
 *         console.nextLine(); // Поглощаем оставшийся символ новой строки
 *
 *         // Запрашиваем у пользователя ввод секретного кода
 *         System.out.println("Введите секретный код:");
 *         String secretCode = console.nextLine(); // Читаем секретный код как строку
 *
 *         // Проверяем возраст
 *         if (/* условие */) {
 *             // Если возраст >= 18, проверяем секретный код
 *             if (/* условие */) {
 *                 // Если код равен "OPEN", разрешаем вход
 *
 *             } else {
 *                 // Если код не равен "OPEN", запрещаем вход
 *
 *             }
 *         } else {
 *             // Если возраст < 18, запрещаем вход
 *
 *         }
 *     }
 * }
 */

// JavaRush
package ru.javarush.java.core.level03.task05;

import java.util.Scanner;

public class Solution {
    public static void main(String[] args) {
        // Создаем объект Scanner для ввода данных с клавиатуры
        Scanner console = new Scanner(System.in);

        // Запрашиваем у пользователя ввод возраста
        System.out.println("Введите ваш возраст:");
        int age = console.nextInt(); // Читаем возраст как целое число
        console.nextLine(); // Поглощаем оставшийся символ новой строки

        // Запрашиваем у пользователя ввод секретного кода
        System.out.println("Введите секретный код:");
        String secretCode = console.nextLine(); // Читаем секретный код как строку

        // Проверяем возраст
        if (age >= 18) {
            // Если возраст >= 18, проверяем секретный код
            if (secretCode.equals("OPEN")) {
                // Если код равен "OPEN", разрешаем вход
            System.out.println("Вход разрешен!");
            } else {
                // Если код не равен "OPEN", запрещаем вход
            System.out.println("Вам сегодня не повезло, вход запрещен.");
            }
        } else {
            // Если возраст < 18, запрещаем вход
            System.out.println("Вам сегодня не повезло, вход запрещен.");
        }
    }
}

/*
 * // JavaRush
 * Правильное решение:
 * // Author: JavaRush's team
 * package ru.javarush.java.core.level03.task05;
 *
 * import java.util.Scanner;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Создаем объект Scanner для ввода данных с клавиатуры
 *         Scanner console = new Scanner(System.in);
 *
 *         // Запрашиваем у пользователя ввод возраста
 *         System.out.println("Введите ваш возраст:");
 *         int age = console.nextInt(); // Читаем возраст как целое число
 *         console.nextLine(); // Поглощаем оставшийся символ новой строки
 *
 *         // Запрашиваем у пользователя ввод секретного кода
 *         System.out.println("Введите секретный код:");
 *         String secretCode = console.nextLine(); // Читаем секретный код как строку
 *
 *         // Проверяем возраст
 *         if (age >= 18) {
 *             // Если возраст >= 18, проверяем секретный код
 *             if ("OPEN".equals(secretCode)) {
 *                 // Если код равен "OPEN", разрешаем вход
 *                 System.out.println("Вход разрешен!");
 *             } else {
 *                 // Если код не равен "OPEN", запрещаем вход
 *                 System.out.println("Вам сегодня не повезло, вход запрещен.");
 *             }
 *         } else {
 *             // Если возраст < 18, запрещаем вход
 *             System.out.println("Вам сегодня не повезло, вход запрещен.");
 *         }
 *     }
 * }
 */