## Authors: JavaRush's team, CodeGym's team, Altavista360
## Version: 1.0.0

### JavaRush
## Задача: Всем привет!
## Ссылка: https://javarush.com/tasks/ru.javarush.python.core.level06.task23

### CodeGym
## Task: Hey everyone!
## Link: https://codegym.cc/tasks/en.codegym.python.core.level06.task23

### JavaRush
## Условие:
# Напиши программу, которая выводит на экран строку "Привет!" на: Китайском Японском Арабском Тайском Тамильском

### JavaRush
## Требования:
# • Программа должна выводить на экран Привет на китайском.
# • Программа должна выводить на экран Привет на японском.
# • Программа должна выводить на экран Привет на арабском.
# • Программа должна выводить на экран Привет на тайском.
# • Программа должна выводить на экран Привет на тамильском.

### JavaRush
## Черновик:
# # Всем привет!
#
# # Напиши программу, которая выводит на экран строку "Привет!" на:
# # Китайском
# # Японском
# # Арабском
# # Тайском
# # Тамильском
#
# # Напишите тут ваш код

### JavaRush
# Всем привет!

# Напиши программу, которая выводит на экран строку "Привет!" на:
# Китайском
# Японском
# Арабском
# Тайском
# Тамильском

# Напишите тут ваш код

print("你好!")
print("こんにちは!")
print("مرحبا!")
print("สวัสดี!")
print("வணக்கம்!")

### JavaRush
## Правильное решение:
## Author: JavaRush's team
# print("你好!")         # Привет на китайском
# print("こんにちは!")  # Привет на японском
# print("مرحبا!")      # Привет на арабском
# print("สวัสดี!")      # Привет на тайском
# print("வணக்கம்!")    # Привет на тамильском