## Authors: JavaRush's team, CodeGym's team, Altavista360
## Version: 1.0.0

### JavaRush
## Задача: Настоящий массив.
## Ссылка: https://javarush.com/tasks/ru.javarush.python.core.level15.task01

### CodeGym
## Task: The Real Array.
## Link: https://codegym.cc/tasks/en.codegym.python.core.level15.task01

### JavaRush
## Условие:
# Создай массив с использованием библиотеки array. Добавь в него 10 случайных чисел от 0 до 1000. Отсортируй и выведи на экран. Класс list использовать нельзя.

### JavaRush
## Требования:
# • Программа должна импортировать библиотеку array для создания и работы с массивом.
# • Программа должна создать массив с использованием библиотеки array для хранения целых чисел (тип 'i').
# • Программа должна добавить в созданный массив 10 случайных чисел в диапазоне от 0 до 1000.
# • Программа должна отсортировать массив с использованием подходящих методов или алгоритмов.
# • Программа должна вывести заполненный массив на экран.
# • Программа не должна использовать класс list для создания и заполнения массива

### JavaRush
## Черновик:
# # Настоящий массив.
#
# # Создай массив с использованием библиотеки array.
# # Добавь в него 10 случайных чисел от 0 до 1000. Отсортируй и выведи на экран.
# # Класс list использовать нельзя.
#
# # Напишите тут ваш код

### JavaRush
# Настоящий массив.

# Создай массив с использованием библиотеки array.
# Добавь в него 10 случайных чисел от 0 до 1000. Отсортируй и выведи на экран.
# Класс list использовать нельзя.

# Напишите тут ваш код

import array
import random

arr = array.array('i')

for _ in range(10):
    arr.append(random.randint(0, 1000))

arr = array.array('i', sorted(arr))

print(arr)

### JavaRush
## Правильное решение:
## Author: JavaRush's team
# import array
# import random
#
# # Создаем массив array с типом элементов 'i' (целые числа)
# arr = array.array('i')
#
# # Добавляем 10 случайных чисел от 0 до 1000
# for _ in range(10):
#     arr.append(random.randint(0, 1000))
#
# # Сортируем массив
# arr = array.array('i', sorted(arr))
#
# # Выводим массив
# print(arr)