/*
 * Authors: JavaRush's team, CodeGym's team, Altavista360
 * Version: 1.0.0
 */

/*
 * // JavaRush
 * Задача: Изменение уровня жизни в игре 📈
 * Ссылка: https://javarush.com/tasks/ru.javarush.java.core.level02.task04
 */

/*
 * // CodeGym
 * Task: Changing the character's health in the game 📈
 * Link: https://codegym.cc/tasks/en.codegym.java.core.level02.task04
 */

/*
 * // JavaRush
 * Условие:
 * Представьте, что вы отслеживаете уровень жизни персонажа в игре. Объявите переменную int heroHealth и присвойте ей значение 10.
 * Увеличьте уровень жизни на 1 с помощью оператора инкремента и выведите новое значение на экран. Затем уменьшите уровень жизни на 1 с помощью оператора декремента. После этих операций снова выведите значение переменной heroHealth на экран.
 */

/*
 * // JavaRush
 * Требования:
 * • В программе должна быть объявлена переменная типа int с именем heroHealth.
 * • Переменной heroHealth должно быть присвоено начальное значение 10.
 * • Значение переменной heroHealth должно быть увеличено на 1 с помощью оператора инкремента.
 * • После увеличения значения переменной heroHealth, новое значение должно быть выведено на экран.
 * • Значение переменной heroHealth должно быть уменьшено на 1 с помощью оператора декремента.
 * • После уменьшения значения переменной heroHealth, новое значение должно быть выведено на экран.
 */

/*
 * // JavaRush
 * Черновик:
 * package ru.javarush.java.core.level02.task04;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Объявляем и инициализируем уровень жизни героя
 *
 *
 *         // Увеличиваем значение на 1 (инкремент) и выводим результат
 *
 *
 *         // Уменьшаем значение на 1 (декремент) и снова выводим результат
 *
 *     }
 * }
 */

// JavaRush
package ru.javarush.java.core.level02.task04;

public class Solution {
    public static void main(String[] args) {
        // Объявляем и инициализируем уровень жизни героя
        int heroHealth = 10;

        // Увеличиваем значение на 1 (инкремент) и выводим результат
        heroHealth++;
        System.out.println(heroHealth);

        // Уменьшаем значение на 1 (декремент) и снова выводим результат
        heroHealth--;
        System.out.println(heroHealth);
    }
}

/*
 * // JavaRush
 * Правильное решение:
 * // Author: JavaRush's team
 * package ru.javarush.java.core.level02.task04;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Объявляем и инициализируем уровень жизни героя
 *         int heroHealth = 10;
 *
 *         // Увеличиваем значение на 1 (инкремент) и выводим результат
 *         heroHealth++;
 *         System.out.println(heroHealth);
 *
 *         // Уменьшаем значение на 1 (декремент) и снова выводим результат
 *         heroHealth--;
 *         System.out.println(heroHealth);
 *     }
 * }
 */