/*
 * Authors: JavaRush's team, CodeGym's team, Altavista360
 * Version: 1.0.0
 */

/*
 * // JavaRush
 * Задача: Возраст главного героя 🦸‍♂️
 * Ссылка: https://javarush.com/tasks/ru.javarush.java.core.level02.task01
 */

/*
 * // CodeGym
 * Task: Main character's age 🦸‍♂️
 * Link: https://codegym.cc/tasks/en.codegym.java.core.level02.task01
 */

/*
 * // JavaRush
 * Условие:
 * Представьте, что вы создаёте игру и хотите задать возраст главного героя.
 * Объявите переменную типа int с именем heroAge и присвойте ей значение 25. Выведите это значение на экран. Создание и присваивание должно быть выполнено в одной строке.
 */

/*
 * // JavaRush
 * Требования:
 * • В программе должна быть объявлена переменная типа int.
 * • Переменная должна иметь имя heroAge.
 * • Переменная heroAge должна быть инициализирована значением 25 непосредственно при объявлении (в одной строке).
 * • Значение переменной heroAge должно быть выведено на экран.
 */

/*
 * // JavaRush
 * Черновик:
 * package ru.javarush.java.core.level02.task01;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Объявляем переменную heroAge типа int и сразу инициализируем её значением 25
 *
 *
 *         // Выводим значение переменной heroAge на экран
 *
 *     }
 * }
 */

// JavaRush
package ru.javarush.java.core.level02.task01;

public class Solution {
    public static void main(String[] args) {
        // Объявляем переменную heroAge типа int и сразу инициализируем её значением 25
        int heroAge = 25;

        // Выводим значение переменной heroAge на экран
        System.out.println(heroAge);
    }
}

/*
 * // JavaRush
 * Правильное решение:
 * // Author: JavaRush's team
 * package ru.javarush.java.core.level02.task01;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Объявляем переменную heroAge типа int и сразу инициализируем её значением 25
 *         int heroAge = 25;
 *
 *         // Выводим значение переменной heroAge на экран
 *         System.out.println(heroAge);
 *     }
 * }
 */