/*
 * Authors: JavaRush's team, CodeGym's team, Altavista360
 * Version: 1.0.0
 */

/*
 * // JavaRush
 * Задача: Размеры данных 📊
 * Ссылка: https://javarush.com/tasks/ru.javarush.java.core.level02.task15
 */

/*
 * // CodeGym
 * Task: Data sizes 📊
 * Link: https://codegym.cc/tasks/en.codegym.java.core.level02.task15
 */

/*
 * // JavaRush
 * Условие:
 * Вы анализируете, сколько памяти занимают разные типы данных.
 * Создайте переменные byte (b), int (i) и double (d) и присвойте им любые значения.
 * Выведите на экран информацию о том, сколько байт занимает каждый тип: byte — 1 байт, int — 4 байта, double — 8 байтов.
 */

/*
 * // JavaRush
 * Требования:
 * • В программе должны быть объявлены переменные типа byte, int и double.
 * • Каждой из переменных (byte, int, double) должно быть присвоено какое-либо значение.
 * • Программа должна выводить информацию о том, что тип byte занимает 1 байт.
 * • Программа должна выводить информацию о том, что тип int занимает 4 байта.
 * • Программа должна выводить информацию о том, что тип double занимает 8 байтов.
 */

/*
 * // JavaRush
 * Черновик:
 * package ru.javarush.java.core.level02.task15;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Объявляем переменные разных типов и присваиваем им произвольные значения
 *
 *
 *         // Выводим информацию о размере каждого типа данных
 *
 *
 *     }
 * }
 */

// JavaRush
package ru.javarush.java.core.level02.task15;

public class Solution {
    public static void main(String[] args) {
        // Объявляем переменные разных типов и присваиваем им произвольные значения
        byte b = 1;
        int i = 13;
        double d = 3.14;
        String foo = "Размер типа ";
        String bar = "байт";

        // Выводим информацию о размере каждого типа данных
        System.out.println(foo + "byte" + ": " + "1" + " " + bar);
        System.out.println(foo + "int" + ": " + "4" + " " + bar + "а");
        System.out.println(foo + "double" + ": " + "8" + " " + bar + "ов");
    }
}

/*
 * // JavaRush
 * Правильное решение:
 * // Author: JavaRush's team
 * package ru.javarush.java.core.level02.task15;
 *
 * public class Solution {
 *     public static void main(String[] args) {
 *         // Объявляем переменные разных типов и присваиваем им произвольные значения
 *         byte b = 42;
 *         int i = 2024;
 *         double d = 3.14159;
 *
 *         // Выводим информацию о размере каждого типа данных
 *         System.out.println("byte — 1 байт");
 *         System.out.println("int — 4 байта");
 *         System.out.println("double — 8 байтов");
 *     }
 * }
 */